/* automatically generated by rust-bindgen */

pub use self::root::*;

unsafe impl Sync for root::JSClass {}
unsafe impl Sync for root::JSFunctionSpec {}
unsafe impl Sync for root::JSNativeWrapper {}
unsafe impl Sync for root::JSPropertySpec {}
unsafe impl Sync for root::JSTypedMethodJitInfo {}

pub mod root {
    #[repr(C)]
    #[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
    pub struct __BindgenBitfieldUnit<Storage, Align> {
        storage: Storage,
        align: [Align; 0],
    }
    impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
        #[inline]
        pub const fn new(storage: Storage) -> Self {
            Self { storage, align: [] }
        }
    }
    impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        #[inline]
        pub fn get_bit(&self, index: usize) -> bool {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = self.storage.as_ref()[byte_index];
            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)
            } else {
                index % 8
            };
            let mask = 1 << bit_index;
            byte & mask == mask
        }
        #[inline]
        pub fn set_bit(&mut self, index: usize, val: bool) {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;

    pub const JSITER_SYMBOLSONLY: u32 = 64;
    pub const JSITER_FORAWAITOF: u32 = 128;
    pub const JS_STRUCTURED_CLONE_VERSION: u32 = 8;
    pub const JS_SCERR_RECURSION: u32 = 0;
    pub const JS_SCERR_TRANSFERABLE: u32 = 1;
    pub const JS_SCERR_DUP_TRANSFERABLE: u32 = 2;
    pub const JS_SCERR_UNSUPPORTED_TYPE: u32 = 3;
    pub const JS_SCERR_SHMEM_TRANSFERABLE: u32 = 4;
    pub type __int8_t = ::std::os::raw::c_schar;
    pub type __uint8_t = ::std::os::raw::c_uchar;
    pub type __int16_t = ::std::os::raw::c_short;
    pub type __uint16_t = ::std::os::raw::c_ushort;
    pub type __int32_t = ::std::os::raw::c_int;
    pub type __uint32_t = ::std::os::raw::c_uint;
    pub type __int64_t = ::std::os::raw::c_long;
    pub type __uint64_t = ::std::os::raw::c_ulong;
    pub type __off_t = ::std::os::raw::c_long;
    pub type __off64_t = ::std::os::raw::c_long;
    pub type uint_fast8_t = ::std::os::raw::c_uchar;
    pub type va_list = root::__builtin_va_list;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_marker {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_codecvt {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_wide_data {
        _unused: [u8; 0],
    }
    pub type _IO_lock_t = ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_FILE {
        pub _flags: ::std::os::raw::c_int,
        pub _IO_read_ptr: *mut ::std::os::raw::c_char,
        pub _IO_read_end: *mut ::std::os::raw::c_char,
        pub _IO_read_base: *mut ::std::os::raw::c_char,
        pub _IO_write_base: *mut ::std::os::raw::c_char,
        pub _IO_write_ptr: *mut ::std::os::raw::c_char,
        pub _IO_write_end: *mut ::std::os::raw::c_char,
        pub _IO_buf_base: *mut ::std::os::raw::c_char,
        pub _IO_buf_end: *mut ::std::os::raw::c_char,
        pub _IO_save_base: *mut ::std::os::raw::c_char,
        pub _IO_backup_base: *mut ::std::os::raw::c_char,
        pub _IO_save_end: *mut ::std::os::raw::c_char,
        pub _markers: *mut root::_IO_marker,
        pub _chain: *mut root::_IO_FILE,
        pub _fileno: ::std::os::raw::c_int,
        pub _flags2: ::std::os::raw::c_int,
        pub _old_offset: root::__off_t,
        pub _cur_column: ::std::os::raw::c_ushort,
        pub _vtable_offset: ::std::os::raw::c_schar,
        pub _shortbuf: [::std::os::raw::c_char; 1usize],
        pub _lock: *mut root::_IO_lock_t,
        pub _offset: root::__off64_t,
        pub _codecvt: *mut root::_IO_codecvt,
        pub _wide_data: *mut root::_IO_wide_data,
        pub _freeres_list: *mut root::_IO_FILE,
        pub _freeres_buf: *mut ::std::os::raw::c_void,
        pub __pad5: usize,
        pub _mode: ::std::os::raw::c_int,
        pub _unused2: [::std::os::raw::c_char; 20usize],
    }
    #[test]
    fn bindgen_test_layout__IO_FILE() {
        assert_eq!(
            ::std::mem::size_of::<_IO_FILE>(),
            216usize,
            concat!("Size of: ", stringify!(_IO_FILE))
        );
        assert_eq!(
            ::std::mem::align_of::<_IO_FILE>(),
            8usize,
            concat!("Alignment of ", stringify!(_IO_FILE))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_ptr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_ptr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_backup_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_markers)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_chain)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_fileno)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags2)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_old_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_cur_column)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
            130usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_vtable_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
            131usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_shortbuf)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_lock)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_codecvt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_wide_data)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_list)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_buf)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(__pad5)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_mode)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_unused2)
            )
        );
    }
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type integral_constant_value_type<_Tp> = _Tp;
        pub type integral_constant_type = u8;
        pub type false_type = u8;
        pub type conditional_type<_Iftrue> = _Iftrue;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct input_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_input_iterator_tag() {
            assert_eq!(
                ::std::mem::size_of::<input_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(input_iterator_tag))
            );
            assert_eq!(
                ::std::mem::align_of::<input_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(input_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct forward_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_forward_iterator_tag() {
            assert_eq!(
                ::std::mem::size_of::<forward_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(forward_iterator_tag))
            );
            assert_eq!(
                ::std::mem::align_of::<forward_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(forward_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct bidirectional_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_bidirectional_iterator_tag() {
            assert_eq!(
                ::std::mem::size_of::<bidirectional_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(bidirectional_iterator_tag))
            );
            assert_eq!(
                ::std::mem::align_of::<bidirectional_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(bidirectional_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct random_access_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_random_access_iterator_tag() {
            assert_eq!(
                ::std::mem::size_of::<random_access_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(random_access_iterator_tag))
            );
            assert_eq!(
                ::std::mem::align_of::<random_access_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(random_access_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct iterator {
            pub _address: u8,
        }
        pub type iterator_iterator_category<_Category> = _Category;
        pub type iterator_value_type<_Tp> = _Tp;
        pub type iterator_difference_type<_Distance> = _Distance;
        pub type iterator_pointer<_Pointer> = _Pointer;
        pub type iterator_reference<_Reference> = _Reference;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __iterator_traits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct iterator_traits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct reverse_iterator<_Iterator> {
            pub current: _Iterator,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
        }
        pub type reverse_iterator___traits_type = root::std::iterator_traits;
        pub type reverse_iterator_iterator_type<_Iterator> = _Iterator;
        pub type reverse_iterator_difference_type = root::std::reverse_iterator___traits_type;
        pub type reverse_iterator_pointer = root::std::reverse_iterator___traits_type;
        pub type reverse_iterator_reference = root::std::reverse_iterator___traits_type;
        #[repr(C)]
        #[derive(Debug)]
        pub struct atomic<_Tp> {
            pub _M_i: _Tp,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
        }
        pub type atomic_value_type<_Tp> = _Tp;
    }
    pub mod __gnu_cxx {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    pub mod mozilla {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type IntegralConstant_ValueType<T> = T;
        pub type IntegralConstant_Type = u8;
        #[doc = " Convenient aliases."]
        pub type TrueType = u8;
        pub type FalseType = u8;
        pub mod detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsVoidHelper {
                pub _base: root::mozilla::FalseType,
            }
            #[test]
            fn __bindgen_test_layout_IsVoidHelper_open0_void_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsVoidHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsVoidHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsVoidHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsVoidHelper)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsIntegralHelper {
                pub _base: root::mozilla::FalseType,
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_char_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_signed_char_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_unsigned_char_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_short_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_unsigned_short_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_unsigned_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_unsigned_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_long_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_unsigned_long_long_close0_instantiation(
            ) {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_bool__close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_wchar_t_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_char16_t_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_IsIntegralHelper_open0_char32_t_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::IsIntegralHelper>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::IsIntegralHelper)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsFloatingPointHelper {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsArrayHelper {
                pub _base: root::mozilla::FalseType,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsFunPtr {
                pub _base: root::mozilla::FalseType,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsPointerHelper {
                pub _base: root::mozilla::FalseType,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsEnumHelper {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsClassHelper {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsMemberPointerHelper {
                pub _base: root::mozilla::FalseType,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsEmptyHelper {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct DoIsDefaultConstructibleImpl {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_DoIsDefaultConstructibleImpl() {
                assert_eq!(
                    ::std::mem::size_of::<DoIsDefaultConstructibleImpl>(),
                    1usize,
                    concat!("Size of: ", stringify!(DoIsDefaultConstructibleImpl))
                );
                assert_eq!(
                    ::std::mem::align_of::<DoIsDefaultConstructibleImpl>(),
                    1usize,
                    concat!("Alignment of ", stringify!(DoIsDefaultConstructibleImpl))
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsDefaultConstructibleImpl {
                pub _address: u8,
            }
            pub type IsDefaultConstructibleImpl_Type<T> = T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct DoIsDestructibleImpl {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_DoIsDestructibleImpl() {
                assert_eq!(
                    ::std::mem::size_of::<DoIsDestructibleImpl>(),
                    1usize,
                    concat!("Size of: ", stringify!(DoIsDestructibleImpl))
                );
                assert_eq!(
                    ::std::mem::align_of::<DoIsDestructibleImpl>(),
                    1usize,
                    concat!("Alignment of ", stringify!(DoIsDestructibleImpl))
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsDestructibleImpl {
                pub _address: u8,
            }
            pub type IsDestructibleImpl_Type<T> = T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct BaseOfTester {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ConvertibleTester {
                pub _address: u8,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum Voidness {
                TIsVoid = 0,
                TIsNotVoid = 1,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct CorrespondingSigned {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingSigned_open0_char_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingSigned_open0_unsigned_char_close0_instantiation()
            {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingSigned_open0_unsigned_short_close0_instantiation()
            {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingSigned_open0_unsigned_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingSigned_open0_unsigned_long_close0_instantiation()
            {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingSigned_open0_unsigned_long_long_close0_instantiation(
            ) {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingSigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingSigned)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct CorrespondingUnsigned {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingUnsigned_open0_char_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingUnsigned_open0_signed_char_close0_instantiation()
            {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingUnsigned_open0_short_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingUnsigned_open0_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingUnsigned_open0_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_CorrespondingUnsigned_open0_long_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::CorrespondingUnsigned>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::CorrespondingUnsigned)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct RemovePointerHelper {
                pub _address: u8,
            }
            pub type RemovePointerHelper_Type<T> = T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AssertionConditionType {
                pub _address: u8,
            }
            pub type AssertionConditionType_ValueT = root::mozilla::RemoveReference;
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum ToSignedness {
                ToIsSigned = 0,
                ToIsUnsigned = 1,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum FromSignedness {
                FromIsSigned = 0,
                FromIsUnsigned = 1,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum UUComparison {
                FromIsBigger = 0,
                FromIsNotBigger = 1,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum USComparison {
                FromIsSmaller = 0,
                FromIsNotSmaller = 1,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AllowDeprecatedAbsFixed {
                pub _base: root::mozilla::FalseType,
            }
            #[test]
            fn __bindgen_test_layout_AllowDeprecatedAbsFixed_open0_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbsFixed)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbsFixed)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AllowDeprecatedAbsFixed_open0_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbsFixed)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbsFixed)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AllowDeprecatedAbs {
                pub _base: root::mozilla::detail::AllowDeprecatedAbsFixed,
            }
            #[test]
            fn __bindgen_test_layout_AllowDeprecatedAbs_open0_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbs>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbs)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbs>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbs)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AllowDeprecatedAbs_open0_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbs>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbs)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbs>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbs)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AbsReturnTypeFixed {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnTypeFixed_open0_signed_char_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnTypeFixed>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnTypeFixed)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnTypeFixed>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnTypeFixed)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnTypeFixed_open0_short_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnTypeFixed>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnTypeFixed)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnTypeFixed>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnTypeFixed)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnTypeFixed_open0_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnTypeFixed>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnTypeFixed)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnTypeFixed>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnTypeFixed)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnTypeFixed_open0_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnTypeFixed>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnTypeFixed)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnTypeFixed>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnTypeFixed)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AbsReturnType {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_char_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_signed_char_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_short_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_long_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_float_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_double_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AbsReturnType_open0_long_double_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AbsReturnType>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AbsReturnType)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct FloatingPointTrait {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_FloatingPointTrait_open0_float_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::FloatingPointTrait>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::FloatingPointTrait)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::FloatingPointTrait>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::FloatingPointTrait)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_FloatingPointTrait_open0_double_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::FloatingPointTrait>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::FloatingPointTrait)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::FloatingPointTrait>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::FloatingPointTrait)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct FuzzyEqualsEpsilon {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_FuzzyEqualsEpsilon_open0_float_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::FuzzyEqualsEpsilon>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::FuzzyEqualsEpsilon)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::FuzzyEqualsEpsilon>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::FuzzyEqualsEpsilon)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_FuzzyEqualsEpsilon_open0_double_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::FuzzyEqualsEpsilon>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::FuzzyEqualsEpsilon)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::FuzzyEqualsEpsilon>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::FuzzyEqualsEpsilon)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AlignasHelper<T> {
                pub mT: T,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct MaybePoisoner {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IteratorRange<IteratorT> {
                pub mIterBegin: IteratorT,
                pub mIterEnd: IteratorT,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<IteratorT>>,
            }
            pub type IteratorRange_iterator<IteratorT> = IteratorT;
            pub type IteratorRange_const_iterator<IteratorT> = IteratorT;
            pub type IteratorRange_reverse_iterator<IteratorT> =
                root::mozilla::ReverseIterator<IteratorT>;
            pub type IteratorRange_const_reverse_iterator<IteratorT> =
                root::mozilla::ReverseIterator<IteratorT>;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AlignedChecker {
                pub _address: u8,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum StorageType {
                AsBase = 0,
                AsMember = 1,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HasPointerTypeHelper {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_HasPointerTypeHelper() {
                assert_eq!(
                    ::std::mem::size_of::<HasPointerTypeHelper>(),
                    1usize,
                    concat!("Size of: ", stringify!(HasPointerTypeHelper))
                );
                assert_eq!(
                    ::std::mem::align_of::<HasPointerTypeHelper>(),
                    1usize,
                    concat!("Alignment of ", stringify!(HasPointerTypeHelper))
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HasPointerType {
                pub _address: u8,
            }
            pub type PointerTypeImpl_Type = [u8; 0usize];
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct PointerType {
                pub _address: u8,
            }
            pub type PointerType_Type = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct UniqueSelector {
                pub _address: u8,
            }
            pub type UniqueSelector_SingleObject = u8;
            pub type supports_os<T> = T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Group {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct CheckConvertibility {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct MakeUnsignedChar {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_MakeUnsignedChar_open0_char16_t_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::MakeUnsignedChar>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::MakeUnsignedChar)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::MakeUnsignedChar>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::MakeUnsignedChar)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_MakeUnsignedChar_open0_char32_t_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::MakeUnsignedChar>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::MakeUnsignedChar)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::MakeUnsignedChar>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::MakeUnsignedChar)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct FunctionTypeTraitsHelper {
                pub _address: u8,
            }
            pub type FunctionTypeTraitsHelper_ReturnType<R> = R;
            pub type FunctionTypeTraitsHelper_ParameterType = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct WrapToSignedHelper {
                pub _address: u8,
            }
            pub type WrapToSignedHelper_SignedType = root::mozilla::MakeSigned;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct WrappingAddHelper {
                pub _address: u8,
            }
            pub type WrappingAddHelper_UnsignedT = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct WrappingSubtractHelper {
                pub _address: u8,
            }
            pub type WrappingSubtractHelper_UnsignedT = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct WrappingMultiplyHelper {
                pub _address: u8,
            }
            pub type WrappingMultiplyHelper_UnsignedT = u8;
            #[doc = " SelectVariantTypeHelper is used in the implementation of SelectVariantType."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct SelectVariantTypeHelper {
                pub _address: u8,
            }
            #[doc = " SelectVariantType takes a type T and a list of variant types Variants and"]
            #[doc = " yields a type Type, selected from Variants, that can store a value of type T"]
            #[doc = " or a reference to type T. If no such type was found, Type is not defined."]
            #[doc = " SelectVariantType also has a `count` member that contains the total number of"]
            #[doc = " selectable types (which will be used to check that a requested type is not"]
            #[doc = " ambiguously present twice.)"]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct SelectVariantType {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct VariantTag {
                pub _address: u8,
            }
            pub type VariantTag_Type = u8;
            #[doc = " AsVariantTemporary stores a value of type T to allow construction of a"]
            #[doc = " Variant value via type inference. Because T is copied and there's no"]
            #[doc = " guarantee that the copy can be elided, AsVariantTemporary is best used with"]
            #[doc = " primitive or very small types."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AsVariantTemporary {
                pub mValue: root::mozilla::RemoveConst,
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum PackingStrategy {
                Variant = 0,
                NullIsOk = 1,
                LowBitTagIsError = 2,
                PackedVariant = 3,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsPackableVariant {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsPackableVariant_VEbool<V, E> {
                pub v: V,
                pub e: E,
                pub ok: bool,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<V>>,
                pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsPackableVariant_EVbool<V, E> {
                pub e: E,
                pub v: V,
                pub ok: bool,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<V>>,
                pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
            }
            pub type IsPackableVariant_Impl = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct UnusedZero {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HasFreeLSB {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_HasFreeLSB_open0_ptr_void_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::HasFreeLSB)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::HasFreeLSB)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct SelectResultImpl {
                pub _address: u8,
            }
            pub type SelectResultImpl_Type = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsResult {
                pub _base: root::mozilla::FalseType,
            }
            pub type IntrinsicBase_ValueType<T> = root::std::atomic<T>;
            pub type IntrinsicBase_OrderedOp = u8;
            pub type IntrinsicMemoryOps_Base = u8;
            pub type IntrinsicAddSub_Base = u8;
            pub type IntrinsicIncDec_Base = u8;
            pub type AtomicIntrinsics_Base = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ToStorageTypeArgument {
                pub _address: u8,
            }
            pub type AtomicBase_Intrinsics = u8;
            pub type AtomicBase_ValueType = root::mozilla::detail::AtomicBase_Intrinsics;
            pub type AtomicBaseIncDec_Base = u8;
            #[doc = " LinkedList supports refcounted elements using this adapter class. Clients"]
            #[doc = " using LinkedList<RefPtr<T>> will get a data structure that holds a strong"]
            #[doc = " reference to T as long as T is in the list."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct LinkedListElementTraits {
                pub _address: u8,
            }
            pub type LinkedListElementTraits_RawType<T> = *mut T;
            pub type LinkedListElementTraits_ConstRawType<T> = *const T;
            pub type LinkedListElementTraits_ClientType<T> = *mut T;
            pub type LinkedListElementTraits_ConstClientType<T> = *const T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTableEntry {
                pub _address: u8,
            }
            pub type HashTableEntry_NonConstT = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct EntrySlot {
                pub mEntry: *mut root::mozilla::detail::EntrySlot_Entry,
                pub mKeyHash: *mut root::mozilla::HashNumber,
            }
            pub type EntrySlot_NonConstT = root::mozilla::RemoveConst;
            pub type EntrySlot_Entry = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable {
                pub _address: u8,
            }
            pub type HashTable_NonConstT = u8;
            pub type HashTable_Key = u8;
            pub type HashTable_Lookup = u8;
            pub type HashTable_Entry = u8;
            pub type HashTable_Slot = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_Ptr {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_AddPtr {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_Iterator {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_ModIterator {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_Range {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_Enum {
                pub _address: u8,
            }
            impl root::mozilla::detail::HashTable_FailureBehavior {
                pub const ReportFailure: root::mozilla::detail::HashTable_FailureBehavior =
                    HashTable_FailureBehavior::DontReportFailure;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum HashTable_FailureBehavior {
                DontReportFailure = 0,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_FakeSlot {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_DoubleHash {
                pub _address: u8,
            }
            impl root::mozilla::detail::HashTable_LookupReason {
                pub const ForAdd: root::mozilla::detail::HashTable_LookupReason =
                    HashTable_LookupReason::ForNonAdd;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum HashTable_LookupReason {
                ForNonAdd = 0,
            }
            impl root::mozilla::detail::HashTable_RebuildStatus {
                pub const Rehashed: root::mozilla::detail::HashTable_RebuildStatus =
                    HashTable_RebuildStatus::NotOverloaded;
            }
            impl root::mozilla::detail::HashTable_RebuildStatus {
                pub const RehashFailed: root::mozilla::detail::HashTable_RebuildStatus =
                    HashTable_RebuildStatus::NotOverloaded;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum HashTable_RebuildStatus {
                NotOverloaded = 0,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum Endianness {
                Little = 0,
                Big = 1,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct EndianUtils {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_EndianUtils() {
                assert_eq!(
                    ::std::mem::size_of::<EndianUtils>(),
                    1usize,
                    concat!("Size of: ", stringify!(EndianUtils))
                );
                assert_eq!(
                    ::std::mem::align_of::<EndianUtils>(),
                    1usize,
                    concat!("Alignment of ", stringify!(EndianUtils))
                );
            }
            pub type EndianReadWrite_super = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct VectorTesting {
                _unused: [u8; 0],
            }
        }
        #[doc = " IsVoid determines whether a type is void."]
        #[doc = ""]
        #[doc = " mozilla::IsVoid<int>::value is false;"]
        #[doc = " mozilla::IsVoid<void>::value is true;"]
        #[doc = " mozilla::IsVoid<void*>::value is false;"]
        #[doc = " mozilla::IsVoid<volatile void>::value is true."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsVoid {
            pub _base: root::mozilla::detail::IsVoidHelper,
        }
        #[doc = " IsIntegral determines whether a type is an integral type."]
        #[doc = ""]
        #[doc = " mozilla::IsIntegral<int>::value is true;"]
        #[doc = " mozilla::IsIntegral<unsigned short>::value is true;"]
        #[doc = " mozilla::IsIntegral<const long>::value is true;"]
        #[doc = " mozilla::IsIntegral<int*>::value is false;"]
        #[doc = " mozilla::IsIntegral<double>::value is false;"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsIntegral {
            pub _base: root::mozilla::detail::IsIntegralHelper,
        }
        #[doc = " IsFloatingPoint determines whether a type is a floating point type (float,"]
        #[doc = " double, long double)."]
        #[doc = ""]
        #[doc = " mozilla::IsFloatingPoint<int>::value is false;"]
        #[doc = " mozilla::IsFloatingPoint<const float>::value is true;"]
        #[doc = " mozilla::IsFloatingPoint<long double>::value is true;"]
        #[doc = " mozilla::IsFloatingPoint<double*>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsFloatingPoint {
            pub _address: u8,
        }
        #[doc = " IsArray determines whether a type is an array type, of known or unknown"]
        #[doc = " length."]
        #[doc = ""]
        #[doc = " mozilla::IsArray<int>::value is false;"]
        #[doc = " mozilla::IsArray<int[]>::value is true;"]
        #[doc = " mozilla::IsArray<int[5]>::value is true."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsArray {
            pub _base: root::mozilla::detail::IsArrayHelper,
        }
        #[doc = " IsFunction determines whether a type is a function type. Function pointers"]
        #[doc = " don't qualify here--only the type of an actual function symbol. We do not"]
        #[doc = " correctly handle varags function types because of a bug in MSVC."]
        #[doc = ""]
        #[doc = " Given the function:"]
        #[doc = "   void f(int) {}"]
        #[doc = ""]
        #[doc = " mozilla::IsFunction<void(int)> is true;"]
        #[doc = " mozilla::IsFunction<void(*)(int)> is false;"]
        #[doc = " mozilla::IsFunction<decltype(f)> is true."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsFunction {
            pub _base: root::mozilla::detail::IsFunPtr,
        }
        #[doc = " IsPointer determines whether a type is a possibly-CV-qualified pointer type"]
        #[doc = " (but not a pointer-to-member type)."]
        #[doc = ""]
        #[doc = " mozilla::IsPointer<struct S*>::value is true;"]
        #[doc = " mozilla::IsPointer<int*>::value is true;"]
        #[doc = " mozilla::IsPointer<int**>::value is true;"]
        #[doc = " mozilla::IsPointer<const int*>::value is true;"]
        #[doc = " mozilla::IsPointer<int* const>::value is true;"]
        #[doc = " mozilla::IsPointer<int* volatile>::value is true;"]
        #[doc = " mozilla::IsPointer<void (*)(void)>::value is true;"]
        #[doc = " mozilla::IsPointer<int>::value is false;"]
        #[doc = " mozilla::IsPointer<struct S>::value is false."]
        #[doc = " mozilla::IsPointer<int(struct S::*)>::value is false"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsPointer {
            pub _base: root::mozilla::detail::IsPointerHelper,
        }
        #[doc = " IsLvalueReference determines whether a type is an lvalue reference."]
        #[doc = ""]
        #[doc = " mozilla::IsLvalueReference<struct S*>::value is false;"]
        #[doc = " mozilla::IsLvalueReference<int**>::value is false;"]
        #[doc = " mozilla::IsLvalueReference<void (*)(void)>::value is false;"]
        #[doc = " mozilla::IsLvalueReference<int>::value is false;"]
        #[doc = " mozilla::IsLvalueReference<struct S>::value is false;"]
        #[doc = " mozilla::IsLvalueReference<struct S*&>::value is true;"]
        #[doc = " mozilla::IsLvalueReference<struct S&&>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsLvalueReference {
            pub _base: root::mozilla::FalseType,
        }
        #[doc = " IsRvalueReference determines whether a type is an rvalue reference."]
        #[doc = ""]
        #[doc = " mozilla::IsRvalueReference<struct S*>::value is false;"]
        #[doc = " mozilla::IsRvalueReference<int**>::value is false;"]
        #[doc = " mozilla::IsRvalueReference<void (*)(void)>::value is false;"]
        #[doc = " mozilla::IsRvalueReference<int>::value is false;"]
        #[doc = " mozilla::IsRvalueReference<struct S>::value is false;"]
        #[doc = " mozilla::IsRvalueReference<struct S*&>::value is false;"]
        #[doc = " mozilla::IsRvalueReference<struct S&&>::value is true."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsRvalueReference {
            pub _base: root::mozilla::FalseType,
        }
        #[doc = " IsEnum determines whether a type is an enum type."]
        #[doc = ""]
        #[doc = " mozilla::IsEnum<enum S>::value is true;"]
        #[doc = " mozilla::IsEnum<enum S*>::value is false;"]
        #[doc = " mozilla::IsEnum<int>::value is false;"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsEnum {
            pub _address: u8,
        }
        #[doc = " IsClass determines whether a type is a class type (but not a union)."]
        #[doc = ""]
        #[doc = " struct S {};"]
        #[doc = " union U {};"]
        #[doc = " mozilla::IsClass<int>::value is false;"]
        #[doc = " mozilla::IsClass<const S>::value is true;"]
        #[doc = " mozilla::IsClass<U>::value is false;"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsClass {
            pub _address: u8,
        }
        #[doc = " IsReference determines whether a type is an lvalue or rvalue reference."]
        #[doc = ""]
        #[doc = " mozilla::IsReference<struct S*>::value is false;"]
        #[doc = " mozilla::IsReference<int**>::value is false;"]
        #[doc = " mozilla::IsReference<int&>::value is true;"]
        #[doc = " mozilla::IsReference<void (*)(void)>::value is false;"]
        #[doc = " mozilla::IsReference<const int&>::value is true;"]
        #[doc = " mozilla::IsReference<int>::value is false;"]
        #[doc = " mozilla::IsReference<struct S>::value is false;"]
        #[doc = " mozilla::IsReference<struct S&>::value is true;"]
        #[doc = " mozilla::IsReference<struct S*&>::value is true;"]
        #[doc = " mozilla::IsReference<struct S&&>::value is true."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsReference {
            pub _address: u8,
        }
        #[doc = " IsArithmetic determines whether a type is arithmetic.  A type is arithmetic"]
        #[doc = " iff it is an integral type or a floating point type."]
        #[doc = ""]
        #[doc = " mozilla::IsArithmetic<int>::value is true;"]
        #[doc = " mozilla::IsArithmetic<double>::value is true;"]
        #[doc = " mozilla::IsArithmetic<long double*>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsArithmetic {
            pub _address: u8,
        }
        #[doc = " IsMemberPointer determines whether a type is pointer to non-static member"]
        #[doc = " object or a pointer to non-static member function."]
        #[doc = ""]
        #[doc = " mozilla::IsMemberPointer<int(cls::*)>::value is true"]
        #[doc = " mozilla::IsMemberPointer<int*>::value is false"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsMemberPointer {
            pub _base: root::mozilla::detail::IsMemberPointerHelper,
        }
        #[doc = " IsScalar determines whether a type is a scalar type."]
        #[doc = ""]
        #[doc = " mozilla::IsScalar<int>::value is true"]
        #[doc = " mozilla::IsScalar<int*>::value is true"]
        #[doc = " mozilla::IsScalar<cls>::value is false"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsScalar {
            pub _address: u8,
        }
        #[doc = " IsConst determines whether a type is const or not."]
        #[doc = ""]
        #[doc = " mozilla::IsConst<int>::value is false;"]
        #[doc = " mozilla::IsConst<void* const>::value is true;"]
        #[doc = " mozilla::IsConst<const char*>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsConst {
            pub _base: root::mozilla::FalseType,
        }
        #[doc = " IsVolatile determines whether a type is volatile or not."]
        #[doc = ""]
        #[doc = " mozilla::IsVolatile<int>::value is false;"]
        #[doc = " mozilla::IsVolatile<void* volatile>::value is true;"]
        #[doc = " mozilla::IsVolatile<volatile char*>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsVolatile {
            pub _base: root::mozilla::FalseType,
        }
        #[doc = " Traits class for identifying POD types.  Until C++11 there's no automatic"]
        #[doc = " way to detect PODs, so for the moment this is done manually.  Users may"]
        #[doc = " define specializations of this class that inherit from mozilla::TrueType and"]
        #[doc = " mozilla::FalseType (or equivalently mozilla::IntegralConstant<bool, true or"]
        #[doc = " false>, or conveniently from mozilla::IsPod for composite types) as needed to"]
        #[doc = " ensure correct IsPod behavior."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsPod {
            pub _base: root::mozilla::FalseType,
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_char_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_signed_char_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_char_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_short_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_short_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_int_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_int_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_long_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_long_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_long_long_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_long_long_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_bool__close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_float_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_double_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_char16_t_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[doc = " IsEmpty determines whether a type is a class (but not a union) that is empty."]
        #[doc = ""]
        #[doc = " A class is empty iff it and all its base classes have no non-static data"]
        #[doc = " members (except bit-fields of length 0) and no virtual member functions, and"]
        #[doc = " no base class is empty or a virtual base class."]
        #[doc = ""]
        #[doc = " Intuitively, empty classes don't have any data that has to be stored in"]
        #[doc = " instances of those classes.  (The size of the class must still be non-zero,"]
        #[doc = " because distinct array elements of any type must have different addresses."]
        #[doc = " However, if the Empty Base Optimization is implemented by the compiler [most"]
        #[doc = " compilers implement it, and in certain cases C++11 requires it], the size of"]
        #[doc = " a class inheriting from an empty |Base| class need not be inflated by"]
        #[doc = " |sizeof(Base)|.)  And intuitively, non-empty classes have data members and/or"]
        #[doc = " vtable pointers that must be stored in each instance for proper behavior."]
        #[doc = ""]
        #[doc = "   static_assert(!mozilla::IsEmpty<int>::value, \"not a class => not empty\");"]
        #[doc = "   union U1 { int x; };"]
        #[doc = "   static_assert(!mozilla::IsEmpty<U1>::value, \"not a class => not empty\");"]
        #[doc = "   struct E1 {};"]
        #[doc = "   struct E2 { int : 0 };"]
        #[doc = "   struct E3 : E1 {};"]
        #[doc = "   struct E4 : E2 {};"]
        #[doc = "   static_assert(mozilla::IsEmpty<E1>::value &&"]
        #[doc = "                 mozilla::IsEmpty<E2>::value &&"]
        #[doc = "                 mozilla::IsEmpty<E3>::value &&"]
        #[doc = "                 mozilla::IsEmpty<E4>::value,"]
        #[doc = "                 \"all empty\");"]
        #[doc = "   union U2 { E1 e1; };"]
        #[doc = "   static_assert(!mozilla::IsEmpty<U2>::value, \"not a class => not empty\");"]
        #[doc = "   struct NE1 { int x; };"]
        #[doc = "   struct NE2 : virtual E1 {};"]
        #[doc = "   struct NE3 : E2 { virtual ~NE3() {} };"]
        #[doc = "   struct NE4 { virtual void f() {} };"]
        #[doc = "   static_assert(!mozilla::IsEmpty<NE1>::value &&"]
        #[doc = "                 !mozilla::IsEmpty<NE2>::value &&"]
        #[doc = "                 !mozilla::IsEmpty<NE3>::value &&"]
        #[doc = "                 !mozilla::IsEmpty<NE4>::value,"]
        #[doc = "                 \"all empty\");"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsEmpty {
            pub _address: u8,
        }
        #[doc = " IsSigned determines whether a type is a signed arithmetic type.  |char| is"]
        #[doc = " considered a signed type if it has the same representation as |signed char|."]
        #[doc = ""]
        #[doc = " mozilla::IsSigned<int>::value is true;"]
        #[doc = " mozilla::IsSigned<const unsigned int>::value is false;"]
        #[doc = " mozilla::IsSigned<unsigned char>::value is false;"]
        #[doc = " mozilla::IsSigned<float>::value is true."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsSigned {
            pub _address: u8,
        }
        #[doc = " IsUnsigned determines whether a type is an unsigned arithmetic type."]
        #[doc = ""]
        #[doc = " mozilla::IsUnsigned<int>::value is false;"]
        #[doc = " mozilla::IsUnsigned<const unsigned int>::value is true;"]
        #[doc = " mozilla::IsUnsigned<unsigned char>::value is true;"]
        #[doc = " mozilla::IsUnsigned<float>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsUnsigned {
            pub _address: u8,
        }
        #[doc = " IsDefaultConstructible determines whether a type has a public default"]
        #[doc = " constructor."]
        #[doc = ""]
        #[doc = " struct S0 {};                    // Implicit default constructor."]
        #[doc = " struct S1 { S1(); };"]
        #[doc = " struct S2 { explicit S2(int); }; // No implicit default constructor when"]
        #[doc = "                                  // another one is present."]
        #[doc = " struct S3 { S3() = delete; };"]
        #[doc = " class C4 { C4(); };              // Default constructor is private."]
        #[doc = ""]
        #[doc = " mozilla::IsDefaultConstructible<int>::value is true;"]
        #[doc = " mozilla::IsDefaultConstructible<S0>::value is true;"]
        #[doc = " mozilla::IsDefaultConstructible<S1>::value is true;"]
        #[doc = " mozilla::IsDefaultConstructible<S2>::value is false;"]
        #[doc = " mozilla::IsDefaultConstructible<S3>::value is false;"]
        #[doc = " mozilla::IsDefaultConstructible<S4>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsDefaultConstructible {
            pub _address: u8,
        }
        #[doc = " IsDestructible determines whether a type has a public destructor."]
        #[doc = ""]
        #[doc = " struct S0 {};                    // Implicit default destructor."]
        #[doc = " struct S1 { ~S1(); };"]
        #[doc = " class C2 { ~C2(); };             // private destructor."]
        #[doc = ""]
        #[doc = " mozilla::IsDestructible<S0>::value is true;"]
        #[doc = " mozilla::IsDestructible<S1>::value is true;"]
        #[doc = " mozilla::IsDestructible<C2>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsDestructible {
            pub _address: u8,
        }
        #[doc = " IsSame tests whether two types are the same type."]
        #[doc = ""]
        #[doc = " mozilla::IsSame<int, int>::value is true;"]
        #[doc = " mozilla::IsSame<int*, int*>::value is true;"]
        #[doc = " mozilla::IsSame<int, unsigned int>::value is false;"]
        #[doc = " mozilla::IsSame<void, void>::value is true;"]
        #[doc = " mozilla::IsSame<const int, int>::value is false;"]
        #[doc = " mozilla::IsSame<struct S, struct S>::value is true."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsSame {
            pub _base: root::mozilla::FalseType,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsBaseOf {
            pub _address: u8,
        }
        #[doc = " IsConvertible determines whether a value of type From will implicitly convert"]
        #[doc = " to a value of type To.  For example:"]
        #[doc = ""]
        #[doc = "   struct A {};"]
        #[doc = "   struct B : public A {};"]
        #[doc = "   struct C {};"]
        #[doc = ""]
        #[doc = " mozilla::IsConvertible<A, A>::value is true;"]
        #[doc = " mozilla::IsConvertible<A*, A*>::value is true;"]
        #[doc = " mozilla::IsConvertible<B, A>::value is true;"]
        #[doc = " mozilla::IsConvertible<B*, A*>::value is true;"]
        #[doc = " mozilla::IsConvertible<C, A>::value is false;"]
        #[doc = " mozilla::IsConvertible<A, C>::value is false;"]
        #[doc = " mozilla::IsConvertible<A*, C*>::value is false;"]
        #[doc = " mozilla::IsConvertible<C*, A*>::value is false."]
        #[doc = ""]
        #[doc = " For obscure reasons, you can't use IsConvertible when the types being tested"]
        #[doc = " are related through private inheritance, and you'll get a compile error if"]
        #[doc = " you try.  Just don't do it!"]
        #[doc = ""]
        #[doc = " Note - we need special handling for void, which ConvertibleTester doesn't"]
        #[doc = " handle. The void handling here doesn't handle const/volatile void correctly,"]
        #[doc = " which could be easily fixed if the need arises."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsConvertible {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_IsConvertible_open0_void_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsConvertible>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsConvertible)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsConvertible>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsConvertible)
                )
            );
        }
        #[doc = " RemoveConst removes top-level const qualifications on a type."]
        #[doc = ""]
        #[doc = " mozilla::RemoveConst<int>::Type is int;"]
        #[doc = " mozilla::RemoveConst<const int>::Type is int;"]
        #[doc = " mozilla::RemoveConst<const int*>::Type is const int*;"]
        #[doc = " mozilla::RemoveConst<int* const>::Type is int*."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RemoveConst {
            pub _address: u8,
        }
        pub type RemoveConst_Type<T> = T;
        #[doc = " RemoveVolatile removes top-level volatile qualifications on a type."]
        #[doc = ""]
        #[doc = " mozilla::RemoveVolatile<int>::Type is int;"]
        #[doc = " mozilla::RemoveVolatile<volatile int>::Type is int;"]
        #[doc = " mozilla::RemoveVolatile<volatile int*>::Type is volatile int*;"]
        #[doc = " mozilla::RemoveVolatile<int* volatile>::Type is int*."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RemoveVolatile {
            pub _address: u8,
        }
        pub type RemoveVolatile_Type<T> = T;
        #[doc = " RemoveCV removes top-level const and volatile qualifications on a type."]
        #[doc = ""]
        #[doc = " mozilla::RemoveCV<int>::Type is int;"]
        #[doc = " mozilla::RemoveCV<const int>::Type is int;"]
        #[doc = " mozilla::RemoveCV<volatile int>::Type is int;"]
        #[doc = " mozilla::RemoveCV<int* const volatile>::Type is int*."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RemoveCV {
            pub _address: u8,
        }
        pub type RemoveCV_Type = root::mozilla::RemoveConst;
        #[doc = " Converts reference types to the underlying types."]
        #[doc = ""]
        #[doc = " mozilla::RemoveReference<T>::Type is T;"]
        #[doc = " mozilla::RemoveReference<T&>::Type is T;"]
        #[doc = " mozilla::RemoveReference<T&&>::Type is T;"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RemoveReference {
            pub _address: u8,
        }
        pub type RemoveReference_Type<T> = T;
        #[doc = " AddLvalueReference adds an lvalue & reference to T if one isn't already"]
        #[doc = " present. (Note: adding an lvalue reference to an rvalue && reference in"]
        #[doc = " essence replaces the && with a &&, per C+11 reference collapsing rules. For"]
        #[doc = " example, int&& would become int&.)"]
        #[doc = ""]
        #[doc = " The final computed type will only *not* be an lvalue reference if T is void."]
        #[doc = ""]
        #[doc = " mozilla::AddLvalueReference<int>::Type is int&;"]
        #[doc = " mozilla::AddLvalueRference<volatile int&>::Type is volatile int&;"]
        #[doc = " mozilla::AddLvalueReference<void*>::Type is void*&;"]
        #[doc = " mozilla::AddLvalueReference<void>::Type is void;"]
        #[doc = " mozilla::AddLvalueReference<struct S&&>::Type is struct S&."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AddLvalueReference {
            pub _address: u8,
        }
        #[doc = " AddRvalueReference adds an rvalue && reference to T if one isn't already"]
        #[doc = " present. (Note: adding an rvalue reference to an lvalue & reference in"]
        #[doc = " essence keeps the &, per C+11 reference collapsing rules. For example,"]
        #[doc = " int& would remain int&.)"]
        #[doc = ""]
        #[doc = " The final computed type will only *not* be a reference if T is void."]
        #[doc = ""]
        #[doc = " mozilla::AddRvalueReference<int>::Type is int&&;"]
        #[doc = " mozilla::AddRvalueRference<volatile int&>::Type is volatile int&;"]
        #[doc = " mozilla::AddRvalueRference<const int&&>::Type is const int&&;"]
        #[doc = " mozilla::AddRvalueReference<void*>::Type is void*&&;"]
        #[doc = " mozilla::AddRvalueReference<void>::Type is void;"]
        #[doc = " mozilla::AddRvalueReference<struct S&>::Type is struct S&."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AddRvalueReference {
            pub _address: u8,
        }
        #[doc = " MakeSigned produces the corresponding signed integer type for a given"]
        #[doc = " integral type T, with the const/volatile qualifiers of T.  T must be a"]
        #[doc = " possibly-const/volatile-qualified integral type that isn't bool."]
        #[doc = ""]
        #[doc = " If T is already a signed integer type (not including char!), then T is"]
        #[doc = " produced."]
        #[doc = ""]
        #[doc = " Otherwise, if T is an unsigned integer type, the signed variety of T, with"]
        #[doc = " T's const/volatile qualifiers, is produced."]
        #[doc = ""]
        #[doc = " Otherwise, the integral type of the same size as T, with the lowest rank,"]
        #[doc = " with T's const/volatile qualifiers, is produced.  (This basically only acts"]
        #[doc = " to produce signed char when T = char.)"]
        #[doc = ""]
        #[doc = " mozilla::MakeSigned<unsigned long>::Type is signed long;"]
        #[doc = " mozilla::MakeSigned<volatile int>::Type is volatile int;"]
        #[doc = " mozilla::MakeSigned<const unsigned short>::Type is const signed short;"]
        #[doc = " mozilla::MakeSigned<const char>::Type is const signed char;"]
        #[doc = " mozilla::MakeSigned<bool> is an error;"]
        #[doc = " mozilla::MakeSigned<void*> is an error."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MakeSigned {
            pub _address: u8,
        }
        #[doc = " MakeUnsigned produces the corresponding unsigned integer type for a given"]
        #[doc = " integral type T, with the const/volatile qualifiers of T.  T must be a"]
        #[doc = " possibly-const/volatile-qualified integral type that isn't bool."]
        #[doc = ""]
        #[doc = " If T is already an unsigned integer type (not including char!), then T is"]
        #[doc = " produced."]
        #[doc = ""]
        #[doc = " Otherwise, if T is an signed integer type, the unsigned variety of T, with"]
        #[doc = " T's const/volatile qualifiers, is produced."]
        #[doc = ""]
        #[doc = " Otherwise, the unsigned integral type of the same size as T, with the lowest"]
        #[doc = " rank, with T's const/volatile qualifiers, is produced.  (This basically only"]
        #[doc = " acts to produce unsigned char when T = char.)"]
        #[doc = ""]
        #[doc = " mozilla::MakeUnsigned<signed long>::Type is unsigned long;"]
        #[doc = " mozilla::MakeUnsigned<volatile unsigned int>::Type is volatile unsigned int;"]
        #[doc = " mozilla::MakeUnsigned<const signed short>::Type is const unsigned short;"]
        #[doc = " mozilla::MakeUnsigned<const char>::Type is const unsigned char;"]
        #[doc = " mozilla::MakeUnsigned<bool> is an error;"]
        #[doc = " mozilla::MakeUnsigned<void*> is an error."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MakeUnsigned {
            pub _address: u8,
        }
        #[doc = " RemoveExtent produces either the type of the elements of the array T, or T"]
        #[doc = " itself."]
        #[doc = ""]
        #[doc = " mozilla::RemoveExtent<int>::Type is int;"]
        #[doc = " mozilla::RemoveExtent<const int[]>::Type is const int;"]
        #[doc = " mozilla::RemoveExtent<volatile int[5]>::Type is volatile int;"]
        #[doc = " mozilla::RemoveExtent<long[][17]>::Type is long[17]."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RemoveExtent {
            pub _address: u8,
        }
        pub type RemoveExtent_Type<T> = T;
        #[doc = " Produces the pointed-to type if a pointer is provided, else returns the input"]
        #[doc = " type.  Note that this does not dereference pointer-to-member pointers."]
        #[doc = ""]
        #[doc = " struct S { bool m; void f(); };"]
        #[doc = " mozilla::RemovePointer<int>::Type is int;"]
        #[doc = " mozilla::RemovePointer<int*>::Type is int;"]
        #[doc = " mozilla::RemovePointer<int* const>::Type is int;"]
        #[doc = " mozilla::RemovePointer<int* volatile>::Type is int;"]
        #[doc = " mozilla::RemovePointer<const long*>::Type is const long;"]
        #[doc = " mozilla::RemovePointer<void* const>::Type is void;"]
        #[doc = " mozilla::RemovePointer<void (S::*)()>::Type is void (S::*)();"]
        #[doc = " mozilla::RemovePointer<void (*)()>::Type is void();"]
        #[doc = " mozilla::RemovePointer<bool S::*>::Type is bool S::*."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RemovePointer {
            pub _address: u8,
        }
        #[doc = " Converts T& to T*. Otherwise returns T* given T. Note that C++17 wants"]
        #[doc = " std::add_pointer to work differently for function types. We don't implement"]
        #[doc = " that behavior here."]
        #[doc = ""]
        #[doc = " mozilla::AddPointer<int> is int*;"]
        #[doc = " mozilla::AddPointer<int*> is int**;"]
        #[doc = " mozilla::AddPointer<int&> is int*;"]
        #[doc = " mozilla::AddPointer<int* const> is int** const."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AddPointer {
            pub _address: u8,
        }
        pub type AddPointer_Type = *mut root::mozilla::RemoveReference;
        pub type Conditional_Type<A> = A;
        #[doc = " Strips const/volatile off a type and decays it from an lvalue to an"]
        #[doc = " rvalue. So function types are converted to function pointers, arrays to"]
        #[doc = " pointers, and references are removed."]
        #[doc = ""]
        #[doc = " mozilla::Decay<int>::Type is int"]
        #[doc = " mozilla::Decay<int&>::Type is int"]
        #[doc = " mozilla::Decay<int&&>::Type is int"]
        #[doc = " mozilla::Decay<const int&>::Type is int"]
        #[doc = " mozilla::Decay<int[2]>::Type is int*"]
        #[doc = " mozilla::Decay<int(int)>::Type is int(*)(int)"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Decay {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unused_t {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct FloatingPoint {
            pub _address: u8,
        }
        pub type FloatingPoint_Base = root::mozilla::detail::FloatingPointTrait;
        #[doc = " An unsigned integral type suitable for accessing the bitwise representation"]
        #[doc = " of T."]
        pub type FloatingPoint_Bits = root::mozilla::FloatingPoint_Base;
        pub type InfinityBits_Traits = root::mozilla::FloatingPoint;
        pub type SpecificNaNBits_Traits = root::mozilla::FloatingPoint;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AlignmentFinder {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct AlignmentFinder_Aligner<T> {
            pub mChar: ::std::os::raw::c_char,
            pub mT: T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        pub struct AlignedStorage2 {
            pub u: root::mozilla::AlignedStorage2_U,
        }
        #[repr(C)]
        pub union AlignedStorage2_U {
            pub mBytes: *mut ::std::os::raw::c_char,
            pub mDummy: u64,
            _bindgen_union_align: u64,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum NotNullTag {
            KnownNotNull = 0,
        }
        #[doc = " A version of CorruptionCanary that is suitable as a member of objects that"]
        #[doc = " are statically allocated."]
        #[repr(C)]
        #[derive(Debug)]
        pub struct CorruptionCanaryForStatics {
            pub mValue: usize,
        }
        pub const CorruptionCanaryForStatics_kCanarySet: usize = 252382987;
        #[test]
        fn bindgen_test_layout_CorruptionCanaryForStatics() {
            assert_eq!(
                ::std::mem::size_of::<CorruptionCanaryForStatics>(),
                8usize,
                concat!("Size of: ", stringify!(CorruptionCanaryForStatics))
            );
            assert_eq!(
                ::std::mem::align_of::<CorruptionCanaryForStatics>(),
                8usize,
                concat!("Alignment of ", stringify!(CorruptionCanaryForStatics))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<CorruptionCanaryForStatics>())).mValue as *const _
                        as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(CorruptionCanaryForStatics),
                    "::",
                    stringify!(mValue)
                )
            );
        }
        #[doc = " This class is designed to cause crashes when various kinds of memory"]
        #[doc = " corruption are observed. For instance, let's say we have a class C where we"]
        #[doc = " suspect out-of-bounds writes to some members.  We can insert a member of type"]
        #[doc = " Poison near the members we suspect are being corrupted by out-of-bounds"]
        #[doc = " writes.  Or perhaps we have a class K we suspect is subject to use-after-free"]
        #[doc = " violations, in which case it doesn't particularly matter where in the class"]
        #[doc = " we add the member of type Poison."]
        #[doc = ""]
        #[doc = " In either case, we then insert calls to Check() throughout the code.  Doing"]
        #[doc = " so enables us to narrow down the location where the corruption is occurring."]
        #[doc = " A pleasant side-effect of these additional Check() calls is that crash"]
        #[doc = " signatures may become more regular, as crashes will ideally occur"]
        #[doc = " consolidated at the point of a Check(), rather than scattered about at"]
        #[doc = " various uses of the corrupted memory."]
        #[repr(C)]
        #[derive(Debug)]
        pub struct CorruptionCanary {
            pub _base: root::mozilla::CorruptionCanaryForStatics,
        }
        #[test]
        fn bindgen_test_layout_CorruptionCanary() {
            assert_eq!(
                ::std::mem::size_of::<CorruptionCanary>(),
                8usize,
                concat!("Size of: ", stringify!(CorruptionCanary))
            );
            assert_eq!(
                ::std::mem::align_of::<CorruptionCanary>(),
                8usize,
                concat!("Alignment of ", stringify!(CorruptionCanary))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Nothing {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Nothing() {
            assert_eq!(
                ::std::mem::size_of::<Nothing>(),
                1usize,
                concat!("Size of: ", stringify!(Nothing))
            );
            assert_eq!(
                ::std::mem::align_of::<Nothing>(),
                1usize,
                concat!("Alignment of ", stringify!(Nothing))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Maybe {
            pub _address: u8,
        }
        pub type Maybe_ValueType = u8;
        pub type MallocSizeOf =
            ::std::option::Option<unsafe extern "C" fn(p: *const ::std::os::raw::c_void) -> usize>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ReverseIterator<IteratorT> {
            pub mCurrent: IteratorT,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<IteratorT>>,
        }
        pub type Array_iterator<T> = *mut T;
        pub type Array_const_iterator<T> = *const T;
        pub type Array_reverse_iterator<T> = root::mozilla::ReverseIterator<T>;
        pub type Array_const_reverse_iterator<T> = root::mozilla::ReverseIterator<T>;
        pub type EnumeratedArray_ArrayType = u8;
        pub type EnumeratedArray_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_const_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_reverse_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_const_reverse_iterator = root::mozilla::EnumeratedArray_ArrayType;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RangedPtr<T> {
            pub mPtr: *mut T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct PositionOfSignBit {
            pub _address: u8,
        }
        #[doc = " MinValue returns the minimum value of the given integer type as a"]
        #[doc = " compile-time constant, which std::numeric_limits<IntegerType>::min()"]
        #[doc = " cannot do in c++98."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MinValue {
            pub _address: u8,
        }
        pub type MinValue_UnsignedIntegerType = root::mozilla::MakeUnsigned;
        #[doc = " MaxValue returns the maximum value of the given integer type as a"]
        #[doc = " compile-time constant, which std::numeric_limits<IntegerType>::max()"]
        #[doc = " cannot do in c++98."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MaxValue {
            pub _address: u8,
        }
        #[doc = " Pair is the logical concatenation of an instance of A with an instance B."]
        #[doc = " Space is conserved when possible.  Neither A nor B may be a final class."]
        #[doc = ""]
        #[doc = " It's typically clearer to have individual A and B member fields.  Except if"]
        #[doc = " you want the space-conserving qualities of Pair, you're probably better off"]
        #[doc = " not using this!"]
        #[doc = ""]
        #[doc = " No guarantees are provided about the memory layout of A and B, the order of"]
        #[doc = " initialization or destruction of A and B, and so on.  (This is approximately"]
        #[doc = " required to optimize space usage.)  The first/second names are merely"]
        #[doc = " conceptual!"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Pair {
            pub _address: u8,
        }
        pub type Pair_Base = u8;
        #[doc = " UniquePtr is a smart pointer that wholly owns a resource.  Ownership may be"]
        #[doc = " transferred out of a UniquePtr through explicit action, but otherwise the"]
        #[doc = " resource is destroyed when the UniquePtr is destroyed."]
        #[doc = ""]
        #[doc = " UniquePtr is similar to C++98's std::auto_ptr, but it improves upon auto_ptr"]
        #[doc = " in one crucial way: it's impossible to copy a UniquePtr.  Copying an auto_ptr"]
        #[doc = " obviously *can't* copy ownership of its singly-owned resource.  So what"]
        #[doc = " happens if you try to copy one?  Bizarrely, ownership is implicitly"]
        #[doc = " *transferred*, preserving single ownership but breaking code that assumes a"]
        #[doc = " copy of an object is identical to the original.  (This is why auto_ptr is"]
        #[doc = " prohibited in STL containers.)"]
        #[doc = ""]
        #[doc = " UniquePtr solves this problem by being *movable* rather than copyable."]
        #[doc = " Instead of passing a |UniquePtr u| directly to the constructor or assignment"]
        #[doc = " operator, you pass |Move(u)|.  In doing so you indicate that you're *moving*"]
        #[doc = " ownership out of |u|, into the target of the construction/assignment.  After"]
        #[doc = " the transfer completes, |u| contains |nullptr| and may be safely destroyed."]
        #[doc = " This preserves single ownership but also allows UniquePtr to be moved by"]
        #[doc = " algorithms that have been made move-safe.  (Note: if |u| is instead a"]
        #[doc = " temporary expression, don't use |Move()|: just pass the expression, because"]
        #[doc = " it's already move-ready.  For more information see Move.h.)"]
        #[doc = ""]
        #[doc = " UniquePtr is also better than std::auto_ptr in that the deletion operation is"]
        #[doc = " customizable.  An optional second template parameter specifies a class that"]
        #[doc = " (through its operator()(T*)) implements the desired deletion policy.  If no"]
        #[doc = " policy is specified, mozilla::DefaultDelete<T> is used -- which will either"]
        #[doc = " |delete| or |delete[]| the resource, depending whether the resource is an"]
        #[doc = " array.  Custom deletion policies ideally should be empty classes (no member"]
        #[doc = " fields, no member fields in base classes, no virtual methods/inheritance),"]
        #[doc = " because then UniquePtr can be just as efficient as a raw pointer."]
        #[doc = ""]
        #[doc = " Use of UniquePtr proceeds like so:"]
        #[doc = ""]
        #[doc = "   UniquePtr<int> g1; // initializes to nullptr"]
        #[doc = "   g1.reset(new int); // switch resources using reset()"]
        #[doc = "   g1 = nullptr; // clears g1, deletes the int"]
        #[doc = ""]
        #[doc = "   UniquePtr<int> g2(new int); // owns that int"]
        #[doc = "   int* p = g2.release(); // g2 leaks its int -- still requires deletion"]
        #[doc = "   delete p; // now freed"]
        #[doc = ""]
        #[doc = "   struct S { int x; S(int x) : x(x) {} };"]
        #[doc = "   UniquePtr<S> g3, g4(new S(5));"]
        #[doc = "   g3 = std::move(g4); // g3 owns the S, g4 cleared"]
        #[doc = "   S* p = g3.get(); // g3 still owns |p|"]
        #[doc = "   assert(g3->x == 5); // operator-> works (if .get() != nullptr)"]
        #[doc = "   assert((*g3).x == 5); // also operator* (again, if not cleared)"]
        #[doc = "   Swap(g3, g4); // g4 now owns the S, g3 cleared"]
        #[doc = "   g3.swap(g4);  // g3 now owns the S, g4 cleared"]
        #[doc = "   UniquePtr<S> g5(std::move(g3)); // g5 owns the S, g3 cleared"]
        #[doc = "   g5.reset(); // deletes the S, g5 cleared"]
        #[doc = ""]
        #[doc = "   struct FreePolicy { void operator()(void* p) { free(p); } };"]
        #[doc = "   UniquePtr<int, FreePolicy> g6(static_cast<int*>(malloc(sizeof(int))));"]
        #[doc = "   int* ptr = g6.get();"]
        #[doc = "   g6 = nullptr; // calls free(ptr)"]
        #[doc = ""]
        #[doc = " Now, carefully note a few things you *can't* do:"]
        #[doc = ""]
        #[doc = "   UniquePtr<int> b1;"]
        #[doc = "   b1 = new int; // BAD: can only assign another UniquePtr"]
        #[doc = "   int* ptr = b1; // BAD: no auto-conversion to pointer, use get()"]
        #[doc = ""]
        #[doc = "   UniquePtr<int> b2(b1); // BAD: can't copy a UniquePtr"]
        #[doc = "   UniquePtr<int> b3 = b1; // BAD: can't copy-assign a UniquePtr"]
        #[doc = ""]
        #[doc = " (Note that changing a UniquePtr to store a direct |new| expression is"]
        #[doc = " permitted, but usually you should use MakeUnique, defined at the end of this"]
        #[doc = " header.)"]
        #[doc = ""]
        #[doc = " A few miscellaneous notes:"]
        #[doc = ""]
        #[doc = " UniquePtr, when not instantiated for an array type, can be move-constructed"]
        #[doc = " and move-assigned, not only from itself but from \"derived\" UniquePtr<U, E>"]
        #[doc = " instantiations where U converts to T and E converts to D.  If you want to use"]
        #[doc = " this, you're going to have to specify a deletion policy for both UniquePtr"]
        #[doc = " instantations, and T pretty much has to have a virtual destructor.  In other"]
        #[doc = " words, this doesn't work:"]
        #[doc = ""]
        #[doc = "   struct Base { virtual ~Base() {} };"]
        #[doc = "   struct Derived : Base {};"]
        #[doc = ""]
        #[doc = "   UniquePtr<Base> b1;"]
        #[doc = "   // BAD: DefaultDelete<Base> and DefaultDelete<Derived> don't interconvert"]
        #[doc = "   UniquePtr<Derived> d1(std::move(b));"]
        #[doc = ""]
        #[doc = "   UniquePtr<Base> b2;"]
        #[doc = "   UniquePtr<Derived, DefaultDelete<Base>> d2(std::move(b2)); // okay"]
        #[doc = ""]
        #[doc = " UniquePtr is specialized for array types.  Specializing with an array type"]
        #[doc = " creates a smart-pointer version of that array -- not a pointer to such an"]
        #[doc = " array."]
        #[doc = ""]
        #[doc = "   UniquePtr<int[]> arr(new int[5]);"]
        #[doc = "   arr[0] = 4;"]
        #[doc = ""]
        #[doc = " What else is different?  Deletion of course uses |delete[]|.  An operator[]"]
        #[doc = " is provided.  Functionality that doesn't make sense for arrays is removed."]
        #[doc = " The constructors and mutating methods only accept array pointers (not T*, U*"]
        #[doc = " that converts to T*, or UniquePtr<U[]> or UniquePtr<U>) or |nullptr|."]
        #[doc = ""]
        #[doc = " It's perfectly okay for a function to return a UniquePtr. This transfers"]
        #[doc = " the UniquePtr's sole ownership of the data, to the fresh UniquePtr created"]
        #[doc = " in the calling function, that will then solely own that data. Such functions"]
        #[doc = " can return a local variable UniquePtr, |nullptr|, |UniquePtr(ptr)| where"]
        #[doc = " |ptr| is a |T*|, or a UniquePtr |Move()|'d from elsewhere."]
        #[doc = ""]
        #[doc = " UniquePtr will commonly be a member of a class, with lifetime equivalent to"]
        #[doc = " that of that class.  If you want to expose the related resource, you could"]
        #[doc = " expose a raw pointer via |get()|, but ownership of a raw pointer is"]
        #[doc = " inherently unclear.  So it's better to expose a |const UniquePtr&| instead."]
        #[doc = " This prohibits mutation but still allows use of |get()| when needed (but"]
        #[doc = " operator-> is preferred).  Of course, you can only use this smart pointer as"]
        #[doc = " long as the enclosing class instance remains live -- no different than if you"]
        #[doc = " exposed the |get()| raw pointer."]
        #[doc = ""]
        #[doc = " To pass a UniquePtr-managed resource as a pointer, use a |const UniquePtr&|"]
        #[doc = " argument.  To specify an inout parameter (where the method may or may not"]
        #[doc = " take ownership of the resource, or reset it), or to specify an out parameter"]
        #[doc = " (where simply returning a |UniquePtr| isn't possible), use a |UniquePtr&|"]
        #[doc = " argument.  To unconditionally transfer ownership of a UniquePtr"]
        #[doc = " into a method, use a |UniquePtr| argument.  To conditionally transfer"]
        #[doc = " ownership of a resource into a method, should the method want it, use a"]
        #[doc = " |UniquePtr&&| argument."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct UniquePtr {
            pub _address: u8,
        }
        pub type UniquePtr_ElementType = u8;
        pub type UniquePtr_DeleterType = u8;
        pub type UniquePtr_Pointer = u8;
        #[doc = " A default deletion policy using plain old operator delete."]
        #[doc = ""]
        #[doc = " Note that this type can be specialized, but authors should beware of the risk"]
        #[doc = " that the specialization may at some point cease to match (either because it"]
        #[doc = " gets moved to a different compilation unit or the signature changes). If the"]
        #[doc = " non-specialized (|delete|-based) version compiles for that type but does the"]
        #[doc = " wrong thing, bad things could happen."]
        #[doc = ""]
        #[doc = " This is a non-issue for types which are always incomplete (i.e. opaque handle"]
        #[doc = " types), since |delete|-ing such a type will always trigger a compilation"]
        #[doc = " error."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct DefaultDelete {
            pub _address: u8,
        }
        pub mod span_details {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            pub type remove_cv_t = root::mozilla::RemoveCV;
            pub type remove_const_t = root::mozilla::RemoveConst;
            pub type conditional_t = u8;
            pub type add_pointer_t = root::mozilla::AddPointer;
            pub type enable_if_t = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_span_oracle {
                pub _base: root::mozilla::FalseType,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_span {
                pub _base: root::mozilla::span_details::is_span_oracle,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_std_array_oracle {
                pub _base: root::mozilla::FalseType,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_std_array {
                pub _base: root::mozilla::span_details::is_std_array_oracle,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_allowed_element_type_conversion {
                pub _address: u8,
            }
            pub type span_iterator_element_type_ = [u8; 0usize];
            pub type span_iterator_iterator_category = root::std::random_access_iterator_tag;
            pub type span_iterator_value_type = root::mozilla::span_details::remove_const_t;
            pub type span_iterator_difference_type = [u8; 0usize];
            pub type span_iterator_reference = *mut [u8; 0usize];
            pub type span_iterator_pointer = root::mozilla::span_details::add_pointer_t;
            pub type extent_type_index_type = usize;
        }
        pub type Span_element_type<ElementType> = ElementType;
        pub type Span_index_type = usize;
        pub type Span_pointer<ElementType> = *mut root::mozilla::Span_element_type<ElementType>;
        pub type Span_reference<ElementType> = *mut root::mozilla::Span_element_type<ElementType>;
        pub type Span_iterator = u8;
        pub type Span_const_iterator = u8;
        pub type Span_reverse_iterator = root::std::reverse_iterator<root::mozilla::Span_iterator>;
        pub type Span_const_reverse_iterator =
            root::std::reverse_iterator<root::mozilla::Span_const_iterator>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Span_storage_type<ElementType, ExtentType> {
            pub _base: ExtentType,
            pub data_: root::mozilla::Span_pointer<ElementType>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<ElementType>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<ExtentType>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Range<T> {
            pub mStart: root::mozilla::RangedPtr<T>,
            pub mEnd: root::mozilla::RangedPtr<T>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct OwningNonNull {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct StaticLocalRefPtr {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct StaticRefPtr {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RefPtrTraits {
            pub _address: u8,
        }
        pub mod tl {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static Min_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static Max_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static FloorLog2_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static CeilingLog2_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static RoundUpPow2_value: usize;
            }
            #[doc = " Compute the number of bits in the given unsigned type."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct BitSize {
                pub _address: u8,
            }
            extern "C" {
                #[link_name = "\u{1}checkPrecondition"]
                pub static NBitMask_checkPrecondition: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static NBitMask_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static MulOverflowMask_value: usize;
            }
        }
        #[doc = " Tuple is a class that stores zero or more objects, whose types are specified"]
        #[doc = " as template parameters. It can be thought of as a generalization of Pair,"]
        #[doc = " (which can be thought of as a 2-tuple)."]
        #[doc = ""]
        #[doc = " Tuple allows index-based access to its elements (with the index having to be"]
        #[doc = " known at compile time) via the non-member function 'Get<N>(tuple)'."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Tuple {
            pub _address: u8,
        }
        pub type Tuple_Impl = u8;
        #[test]
        fn __bindgen_test_layout_Tuple_open0_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::Tuple>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::Tuple)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::Tuple>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::Tuple)
                )
            );
        }
        #[doc = " A code unit within a UTF-8 encoded string.  (A code unit is the smallest"]
        #[doc = " unit within the Unicode encoding of a string.  For UTF-8 this is an 8-bit"]
        #[doc = " number; for UTF-16 it would be a 16-bit number.)"]
        #[doc = ""]
        #[doc = " This is *not* the same as a single code point: in UTF-8, non-ASCII code"]
        #[doc = " points are constituted by multiple code units."]
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub union Utf8Unit {
            pub mValue: ::std::os::raw::c_char,
            _bindgen_union_align: u8,
        }
        #[test]
        fn bindgen_test_layout_Utf8Unit() {
            assert_eq!(
                ::std::mem::size_of::<Utf8Unit>(),
                1usize,
                concat!("Size of: ", stringify!(Utf8Unit))
            );
            assert_eq!(
                ::std::mem::align_of::<Utf8Unit>(),
                1usize,
                concat!("Alignment of ", stringify!(Utf8Unit))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<Utf8Unit>())).mValue as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Utf8Unit),
                    "::",
                    stringify!(mValue)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct FunctionTypeTraits {
            pub _address: u8,
        }
        pub type HashNumber = u32;
        #[doc = " A pseudorandom function mapping 32-bit integers to 32-bit integers."]
        #[doc = ""]
        #[doc = " This is for when you're feeding private data (like pointer values or credit"]
        #[doc = " card numbers) to a non-crypto hash function (like HashBytes) and then using"]
        #[doc = " the hash code for something that untrusted parties could observe (like a JS"]
        #[doc = " Map). Plug in a HashCodeScrambler before that last step to avoid leaking the"]
        #[doc = " private data."]
        #[doc = ""]
        #[doc = " By itself, this does not prevent hash-flooding DoS attacks, because an"]
        #[doc = " attacker can still generate many values with exactly equal hash codes by"]
        #[doc = " attacking the non-crypto hash function alone. Equal hash codes will, of"]
        #[doc = " course, still be equal however much you scramble them."]
        #[doc = ""]
        #[doc = " The algorithm is SipHash-1-3. See <https://131002.net/siphash/>."]
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct HashCodeScrambler {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct HashCodeScrambler_SipHasher {
            pub _bindgen_opaque_blob: [u64; 4usize],
        }
        #[test]
        fn bindgen_test_layout_HashCodeScrambler_SipHasher() {
            assert_eq!(
                ::std::mem::size_of::<HashCodeScrambler_SipHasher>(),
                32usize,
                concat!("Size of: ", stringify!(HashCodeScrambler_SipHasher))
            );
            assert_eq!(
                ::std::mem::align_of::<HashCodeScrambler_SipHasher>(),
                8usize,
                concat!("Alignment of ", stringify!(HashCodeScrambler_SipHasher))
            );
        }
        #[test]
        fn bindgen_test_layout_HashCodeScrambler() {
            assert_eq!(
                ::std::mem::size_of::<HashCodeScrambler>(),
                16usize,
                concat!("Size of: ", stringify!(HashCodeScrambler))
            );
            assert_eq!(
                ::std::mem::align_of::<HashCodeScrambler>(),
                8usize,
                concat!("Alignment of ", stringify!(HashCodeScrambler))
            );
        }
        pub mod ipc {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IPDLParamTraits {
                pub _address: u8,
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct VariantType {
            pub _address: u8,
        }
        pub type VariantType_Type<T> = T;
        extern "C" {
            #[link_name = "\u{1}index"]
            pub static VariantIndex_index: usize;
        }
        #[doc = " # mozilla::Variant"]
        #[doc = ""]
        #[doc = " A variant / tagged union / heterogenous disjoint union / sum-type template"]
        #[doc = " class. Similar in concept to (but not derived from) `boost::variant`."]
        #[doc = ""]
        #[doc = " Sometimes, you may wish to use a C union with non-POD types. However, this is"]
        #[doc = " forbidden in C++ because it is not clear which type in the union should have"]
        #[doc = " its constructor and destructor run on creation and deletion"]
        #[doc = " respectively. This is the problem that `mozilla::Variant` solves."]
        #[doc = ""]
        #[doc = " ## Usage"]
        #[doc = ""]
        #[doc = " A `mozilla::Variant` instance is constructed (via move or copy) from one of"]
        #[doc = " its variant types (ignoring const and references). It does *not* support"]
        #[doc = " construction from subclasses of variant types or types that coerce to one of"]
        #[doc = " the variant types."]
        #[doc = ""]
        #[doc = "     Variant<char, uint32_t> v1('a');"]
        #[doc = "     Variant<UniquePtr<A>, B, C> v2(MakeUnique<A>());"]
        #[doc = "     Variant<bool, char> v3(VariantType<char>, 0); // disambiguation needed"]
        #[doc = "     Variant<int, int> v4(VariantIndex<1>, 0); // 2nd int"]
        #[doc = ""]
        #[doc = " Because specifying the full type of a Variant value is often verbose,"]
        #[doc = " there are two easier ways to construct values:"]
        #[doc = ""]
        #[doc = " A. AsVariant() can be used to construct a Variant value using type inference"]
        #[doc = " in contexts such as expressions or when returning values from functions."]
        #[doc = " Because AsVariant() must copy or move the value into a temporary and this"]
        #[doc = " cannot necessarily be elided by the compiler, it's mostly appropriate only"]
        #[doc = " for use with primitive or very small types."]
        #[doc = ""]
        #[doc = "     Variant<char, uint32_t> Foo() { return AsVariant('x'); }"]
        #[doc = "     // ..."]
        #[doc = "     Variant<char, uint32_t> v1 = Foo();  // v1 holds char('x')."]
        #[doc = ""]
        #[doc = " B. Brace-construction with VariantType or VariantIndex; this also allows"]
        #[doc = " in-place construction with any number of arguments."]
        #[doc = ""]
        #[doc = "     struct AB { AB(int, int){...} };"]
        #[doc = "     static Variant<AB, bool> foo()"]
        #[doc = "     {"]
        #[doc = "       return {VariantIndex<0>{}, 1, 2};"]
        #[doc = "     }"]
        #[doc = "     // ..."]
        #[doc = "     Variant<AB, bool> v0 = Foo();  // v0 holds AB(1,2)."]
        #[doc = ""]
        #[doc = " All access to the contained value goes through type-safe accessors."]
        #[doc = " Either the stored type, or the type index may be provided."]
        #[doc = ""]
        #[doc = "     void"]
        #[doc = "     Foo(Variant<A, B, C> v)"]
        #[doc = "     {"]
        #[doc = "       if (v.is<A>()) {"]
        #[doc = "         A& ref = v.as<A>();"]
        #[doc = "         ..."]
        #[doc = "       } else (v.is<1>()) { // Instead of v.is<B>."]
        #[doc = "         ..."]
        #[doc = "       } else {"]
        #[doc = "         ..."]
        #[doc = "       }"]
        #[doc = "     }"]
        #[doc = ""]
        #[doc = " In some situation, a Variant may be constructed from templated types, in"]
        #[doc = " which case it is possible that the same type could be given multiple times by"]
        #[doc = " an external developer. Or seemingly-different types could be aliases."]
        #[doc = " In this case, repeated types can only be accessed through their index, to"]
        #[doc = " prevent ambiguous access by type."]
        #[doc = ""]
        #[doc = "    // Bad!"]
        #[doc = "    template <typename T>"]
        #[doc = "    struct ResultOrError"]
        #[doc = "    {"]
        #[doc = "      Variant<T, int> m;"]
        #[doc = "      ResultOrError() : m(int(0)) {} // Error '0' by default"]
        #[doc = "      ResultOrError(const T& r) : m(r) {}"]
        #[doc = "      bool IsResult() const { return m.is<T>(); }"]
        #[doc = "      bool IsError() const { return m.is<int>(); }"]
        #[doc = "    };"]
        #[doc = "    // Now instantiante with the result being an int too:"]
        #[doc = "    ResultOrError<int> myResult(123); // Fail!"]
        #[doc = "    // In Variant<int, int>, which 'int' are we refering to, from inside"]
        #[doc = "    // ResultOrError functions?"]
        #[doc = ""]
        #[doc = "    // Good!"]
        #[doc = "    template <typename T>"]
        #[doc = "    struct ResultOrError"]
        #[doc = "    {"]
        #[doc = "      Variant<T, int> m;"]
        #[doc = "      ResultOrError() : m(VariantIndex<1>{}, 0) {} // Error '0' by default"]
        #[doc = "      ResultOrError(const T& r) : m(VariantIndex<0>{}, r) {}"]
        #[doc = "      bool IsResult() const { return m.is<0>(); } // 0 -> T"]
        #[doc = "      bool IsError() const { return m.is<1>(); } // 1 -> int"]
        #[doc = "    };"]
        #[doc = "    // Now instantiante with the result being an int too:"]
        #[doc = "    ResultOrError<int> myResult(123); // It now works!"]
        #[doc = ""]
        #[doc = " Attempting to use the contained value as type `T1` when the `Variant`"]
        #[doc = " instance contains a value of type `T2` causes an assertion failure."]
        #[doc = ""]
        #[doc = "     A a;"]
        #[doc = "     Variant<A, B, C> v(a);"]
        #[doc = "     v.as<B>(); // <--- Assertion failure!"]
        #[doc = ""]
        #[doc = " Trying to use a `Variant<Ts...>` instance as some type `U` that is not a"]
        #[doc = " member of the set of `Ts...` is a compiler error."]
        #[doc = ""]
        #[doc = "     A a;"]
        #[doc = "     Variant<A, B, C> v(a);"]
        #[doc = "     v.as<SomeRandomType>(); // <--- Compiler error!"]
        #[doc = ""]
        #[doc = " Additionally, you can turn a `Variant` that `is<T>` into a `T` by moving it"]
        #[doc = " out of the containing `Variant` instance with the `extract<T>` method:"]
        #[doc = ""]
        #[doc = "     Variant<UniquePtr<A>, B, C> v(MakeUnique<A>());"]
        #[doc = "     auto ptr = v.extract<UniquePtr<A>>();"]
        #[doc = ""]
        #[doc = " Finally, you can exhaustively match on the contained variant and branch into"]
        #[doc = " different code paths depending on which type is contained. This is preferred"]
        #[doc = " to manually checking every variant type T with is<T>() because it provides"]
        #[doc = " compile-time checking that you handled every type, rather than runtime"]
        #[doc = " assertion failures."]
        #[doc = ""]
        #[doc = "     // Bad!"]
        #[doc = "     char* foo(Variant<A, B, C, D>& v) {"]
        #[doc = "       if (v.is<A>()) {"]
        #[doc = "         return ...;"]
        #[doc = "       } else if (v.is<B>()) {"]
        #[doc = "         return ...;"]
        #[doc = "       } else {"]
        #[doc = "         return doSomething(v.as<C>()); // Forgot about case D!"]
        #[doc = "       }"]
        #[doc = "     }"]
        #[doc = ""]
        #[doc = "     // Instead, a single function object (that can deal with all possible"]
        #[doc = "     // options) may be provided:"]
        #[doc = "     struct FooMatcher"]
        #[doc = "     {"]
        #[doc = "       // The return type of all matchers must be identical."]
        #[doc = "       char* operator()(A& a) { ... }"]
        #[doc = "       char* operator()(B& b) { ... }"]
        #[doc = "       char* operator()(C& c) { ... }"]
        #[doc = "       char* operator()(D& d) { ... } // Compile-time error to forget D!"]
        #[doc = "     }"]
        #[doc = "     char* foo(Variant<A, B, C, D>& v) {"]
        #[doc = "       return v.match(FooMatcher());"]
        #[doc = "     }"]
        #[doc = ""]
        #[doc = "     // In some situations, a single generic lambda may also be appropriate:"]
        #[doc = "     char* foo(Variant<A, B, C, D>& v) {"]
        #[doc = "       return v.match([](auto&){...});"]
        #[doc = "     }"]
        #[doc = ""]
        #[doc = "     // Alternatively, multiple function objects may be provided, each one"]
        #[doc = "     // corresponding to an option, in the same order:"]
        #[doc = "     char* foo(Variant<A, B, C, D>& v) {"]
        #[doc = "       return v.match([](A&) { ... },"]
        #[doc = "                      [](B&) { ... },"]
        #[doc = "                      [](C&) { ... },"]
        #[doc = "                      [](D&) { ... });"]
        #[doc = "     }"]
        #[doc = ""]
        #[doc = " ## Examples"]
        #[doc = ""]
        #[doc = " A tree is either an empty leaf, or a node with a value and two children:"]
        #[doc = ""]
        #[doc = "     struct Leaf { };"]
        #[doc = ""]
        #[doc = "     template<typename T>"]
        #[doc = "     struct Node"]
        #[doc = "     {"]
        #[doc = "       T value;"]
        #[doc = "       Tree<T>* left;"]
        #[doc = "       Tree<T>* right;"]
        #[doc = "     };"]
        #[doc = ""]
        #[doc = "     template<typename T>"]
        #[doc = "     using Tree = Variant<Leaf, Node<T>>;"]
        #[doc = ""]
        #[doc = " A copy-on-write string is either a non-owning reference to some existing"]
        #[doc = " string, or an owning reference to our copy:"]
        #[doc = ""]
        #[doc = "     class CopyOnWriteString"]
        #[doc = "     {"]
        #[doc = "       Variant<const char*, UniquePtr<char[]>> string;"]
        #[doc = ""]
        #[doc = "       ..."]
        #[doc = "     };"]
        #[doc = ""]
        #[doc = " Because Variant must be aligned suitable to hold any value stored within it,"]
        #[doc = " and because |alignas| requirements don't affect platform ABI with respect to"]
        #[doc = " how parameters are laid out in memory, Variant can't be used as the type of a"]
        #[doc = " function parameter.  Pass Variant to functions by pointer or reference"]
        #[doc = " instead."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Variant {
            pub _address: u8,
        }
        pub type Variant_Tag = root::mozilla::detail::VariantTag;
        pub type Variant_Impl = u8;
        #[doc = " Empty struct, indicating success for operations that have no return value."]
        #[doc = " For example, if you declare another empty struct `struct OutOfMemory {};`,"]
        #[doc = " then `Result<Ok, OutOfMemory>` represents either success or OOM."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Ok {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Ok() {
            assert_eq!(
                ::std::mem::size_of::<Ok>(),
                1usize,
                concat!("Size of: ", stringify!(Ok))
            );
            assert_eq!(
                ::std::mem::align_of::<Ok>(),
                1usize,
                concat!("Alignment of ", stringify!(Ok))
            );
        }
        #[doc = " Result<V, E> represents the outcome of an operation that can either succeed"]
        #[doc = " or fail. It contains either a success value of type V or an error value of"]
        #[doc = " type E."]
        #[doc = ""]
        #[doc = " All Result methods are const, so results are basically immutable."]
        #[doc = " This is just like Variant<V, E> but with a slightly different API, and the"]
        #[doc = " following cases are optimized so Result can be stored more efficiently:"]
        #[doc = ""]
        #[doc = " - If the success type is Ok (or another empty class) and the error type is a"]
        #[doc = "   reference, Result<V, E&> is guaranteed to be pointer-sized and all zero"]
        #[doc = "   bits on success. Do not change this representation! There is JIT code that"]
        #[doc = "   depends on it."]
        #[doc = ""]
        #[doc = " - If the success type is a pointer type and the error type is a reference"]
        #[doc = "   type, and the least significant bit is unused for both types when stored"]
        #[doc = "   as a pointer (due to alignment rules), Result<V*, E&> is guaranteed to be"]
        #[doc = "   pointer-sized. In this case, we use the lowest bit as tag bit: 0 to"]
        #[doc = "   indicate the Result's bits are a V, 1 to indicate the Result's bits (with"]
        #[doc = "   the 1 masked out) encode an E*."]
        #[doc = ""]
        #[doc = " The purpose of Result is to reduce the screwups caused by using `false` or"]
        #[doc = " `nullptr` to indicate errors."]
        #[doc = " What screwups? See <https://bugzilla.mozilla.org/show_bug.cgi?id=912928> for"]
        #[doc = " a partial list."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Result {
            pub mImpl: root::mozilla::Result_Impl,
        }
        pub type Result_Impl = root::mozilla::detail::SelectResultImpl;
        #[doc = " A type that auto-converts to an error Result. This is like a Result without"]
        #[doc = " a success type. It's the best return type for functions that always return"]
        #[doc = " an error--functions designed to build and populate error objects. It's also"]
        #[doc = " useful in error-handling macros; see MOZ_TRY for an example."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GenericErrorResult<E> {
            pub mErrorValue: E,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
        }
        pub mod recordreplay {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug)]
            pub struct AutoOrderedAtomicAccess {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_AutoOrderedAtomicAccess() {
                assert_eq!(
                    ::std::mem::size_of::<AutoOrderedAtomicAccess>(),
                    1usize,
                    concat!("Size of: ", stringify!(AutoOrderedAtomicAccess))
                );
                assert_eq!(
                    ::std::mem::align_of::<AutoOrderedAtomicAccess>(),
                    1usize,
                    concat!("Alignment of ", stringify!(AutoOrderedAtomicAccess))
                );
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct AutoPassThroughThreadEvents {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_AutoPassThroughThreadEvents() {
                assert_eq!(
                    ::std::mem::size_of::<AutoPassThroughThreadEvents>(),
                    1usize,
                    concat!("Size of: ", stringify!(AutoPassThroughThreadEvents))
                );
                assert_eq!(
                    ::std::mem::align_of::<AutoPassThroughThreadEvents>(),
                    1usize,
                    concat!("Alignment of ", stringify!(AutoPassThroughThreadEvents))
                );
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct AutoEnsurePassThroughThreadEvents {
                pub mPassedThrough: bool,
            }
            #[test]
            fn bindgen_test_layout_AutoEnsurePassThroughThreadEvents() {
                assert_eq!(
                    ::std::mem::size_of::<AutoEnsurePassThroughThreadEvents>(),
                    1usize,
                    concat!("Size of: ", stringify!(AutoEnsurePassThroughThreadEvents))
                );
                assert_eq!(
                    ::std::mem::align_of::<AutoEnsurePassThroughThreadEvents>(),
                    1usize,
                    concat!(
                        "Alignment of ",
                        stringify!(AutoEnsurePassThroughThreadEvents)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::std::ptr::null::<AutoEnsurePassThroughThreadEvents>())).mPassedThrough
                            as *const _ as usize
                    },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(AutoEnsurePassThroughThreadEvents),
                        "::",
                        stringify!(mPassedThrough)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct AutoDisallowThreadEvents {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_AutoDisallowThreadEvents() {
                assert_eq!(
                    ::std::mem::size_of::<AutoDisallowThreadEvents>(),
                    1usize,
                    concat!("Size of: ", stringify!(AutoDisallowThreadEvents))
                );
                assert_eq!(
                    ::std::mem::align_of::<AutoDisallowThreadEvents>(),
                    1usize,
                    concat!("Alignment of ", stringify!(AutoDisallowThreadEvents))
                );
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum Behavior {
                DontPreserve = 0,
                Preserve = 1,
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum ProcessKind {
                Recording = 0,
                Replaying = 1,
                MiddlemanRecording = 2,
                MiddlemanReplaying = 3,
            }
            #[doc = ""]
            pub type ProgressCounter = u64;
        }
        #[repr(u32)]
        #[doc = " An enum of memory ordering possibilities for atomics."]
        #[doc = ""]
        #[doc = " Memory ordering is the observable state of distinct values in memory."]
        #[doc = " (It's a separate concept from atomicity, which concerns whether an"]
        #[doc = " operation can ever be observed in an intermediate state.  Don't"]
        #[doc = " conflate the two!)  Given a sequence of operations in source code on"]
        #[doc = " memory, it is *not* always the case that, at all times and on all"]
        #[doc = " cores, those operations will appear to have occurred in that exact"]
        #[doc = " sequence.  First, the compiler might reorder that sequence, if it"]
        #[doc = " thinks another ordering will be more efficient.  Second, the CPU may"]
        #[doc = " not expose so consistent a view of memory.  CPUs will often perform"]
        #[doc = " their own instruction reordering, above and beyond that performed by"]
        #[doc = " the compiler.  And each core has its own memory caches, and accesses"]
        #[doc = " (reads and writes both) to \"memory\" may only resolve to out-of-date"]
        #[doc = " cache entries -- not to the \"most recently\" performed operation in"]
        #[doc = " some global sense.  Any access to a value that may be used by"]
        #[doc = " multiple threads, potentially across multiple cores, must therefore"]
        #[doc = " have a memory ordering imposed on it, for all code on all"]
        #[doc = " threads/cores to have a sufficiently coherent worldview."]
        #[doc = ""]
        #[doc = " http://gcc.gnu.org/wiki/Atomic/GCCMM/AtomicSync and"]
        #[doc = " http://en.cppreference.com/w/cpp/atomic/memory_order go into more"]
        #[doc = " detail on all this, including examples of how each mode works."]
        #[doc = ""]
        #[doc = " Note that for simplicity and practicality, not all of the modes in"]
        #[doc = " C++11 are supported.  The missing C++11 modes are either subsumed by"]
        #[doc = " the modes we provide below, or not relevant for the CPUs we support"]
        #[doc = " in Gecko.  These three modes are confusing enough as it is!"]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum MemoryOrdering {
            Relaxed = 0,
            ReleaseAcquire = 1,
            SequentiallyConsistent = 2,
        }
        #[doc = " DebugOnly contains a value of type T, but only in debug builds.  In release"]
        #[doc = " builds, it does not contain a value.  This helper is intended to be used with"]
        #[doc = " MOZ_ASSERT()-style macros, allowing one to write:"]
        #[doc = ""]
        #[doc = "   DebugOnly<bool> check = func();"]
        #[doc = "   MOZ_ASSERT(check);"]
        #[doc = ""]
        #[doc = " more concisely than declaring |check| conditional on #ifdef DEBUG."]
        #[doc = ""]
        #[doc = " DebugOnly instances can only be coerced to T in debug builds.  In release"]
        #[doc = " builds they don't have a value, so type coercion is not well defined."]
        #[doc = ""]
        #[doc = " NOTE: DebugOnly instances still take up one byte of space, plus padding, even"]
        #[doc = " in optimized, non-DEBUG builds (see bug 1253094 comment 37 for more info)."]
        #[doc = " For this reason the class is MOZ_STACK_CLASS to prevent consumers using"]
        #[doc = " DebugOnly for struct/class members and unwittingly inflating the size of"]
        #[doc = " their objects in release builds."]
        #[repr(C)]
        #[derive(Debug)]
        pub struct DebugOnly {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct LinkedListElement {
            pub mNext: *mut root::mozilla::LinkedListElement,
            pub mPrev: *mut root::mozilla::LinkedListElement,
            pub mIsSentinel: bool,
        }
        pub type LinkedListElement_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type LinkedListElement_RawType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ConstRawType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ClientType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ConstClientType = root::mozilla::LinkedListElement_Traits;
        impl root::mozilla::LinkedListElement_NodeKind {
            pub const Sentinel: root::mozilla::LinkedListElement_NodeKind =
                LinkedListElement_NodeKind::Normal;
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum LinkedListElement_NodeKind {
            Normal = 0,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct LinkedList {
            pub sentinel: root::mozilla::LinkedListElement,
        }
        pub type LinkedList_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type LinkedList_RawType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ConstRawType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ClientType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ConstClientType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ElementType = *mut root::mozilla::LinkedListElement;
        pub type LinkedList_ConstElementType = *const root::mozilla::LinkedListElement;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct LinkedList_Iterator<Type> {
            pub mCurrent: Type,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Type>>,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct AutoCleanLinkedList {
            pub _base: root::mozilla::LinkedList,
        }
        pub type AutoCleanLinkedList_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type AutoCleanLinkedList_ClientType = root::mozilla::detail::LinkedListElementTraits;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MallocAllocPolicy {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_MallocAllocPolicy() {
            assert_eq!(
                ::std::mem::size_of::<MallocAllocPolicy>(),
                1usize,
                concat!("Size of: ", stringify!(MallocAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<MallocAllocPolicy>(),
                1usize,
                concat!("Alignment of ", stringify!(MallocAllocPolicy))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct NeverAllocPolicy {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_NeverAllocPolicy() {
            assert_eq!(
                ::std::mem::size_of::<NeverAllocPolicy>(),
                1usize,
                concat!("Size of: ", stringify!(NeverAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<NeverAllocPolicy>(),
                1usize,
                concat!("Alignment of ", stringify!(NeverAllocPolicy))
            );
        }
        #[doc = " Opaque<T> is a replacement for integral T in cases where only comparisons"]
        #[doc = " must be supported, and it's desirable to prevent accidental dependency on"]
        #[doc = " exact values."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Opaque<T> {
            pub mValue: T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct ReentrancyGuard {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_ReentrancyGuard() {
            assert_eq!(
                ::std::mem::size_of::<ReentrancyGuard>(),
                1usize,
                concat!("Size of: ", stringify!(ReentrancyGuard))
            );
            assert_eq!(
                ::std::mem::align_of::<ReentrancyGuard>(),
                1usize,
                concat!("Alignment of ", stringify!(ReentrancyGuard))
            );
        }
        pub type Generation = root::mozilla::Opaque<u64>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashMap {
            pub _address: u8,
        }
        pub type HashMap_TableEntry = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashMap_MapHashPolicy {
            pub _address: u8,
        }
        pub type HashMap_MapHashPolicy_Base = u8;
        pub type HashMap_MapHashPolicy_KeyType = u8;
        pub type HashMap_Impl = u8;
        pub type HashMap_Lookup = u8;
        pub type HashMap_Entry = u8;
        pub type HashMap_Ptr = u8;
        pub type HashMap_AddPtr = u8;
        pub type HashMap_Iterator = u8;
        pub type HashMap_ModIterator = u8;
        pub type HashMap_Range = u8;
        pub type HashMap_Enum = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashSet {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashSet_SetHashPolicy {
            pub _address: u8,
        }
        pub type HashSet_SetHashPolicy_Base = u8;
        pub type HashSet_SetHashPolicy_KeyType = u8;
        pub type HashSet_Impl = u8;
        pub type HashSet_Lookup = u8;
        pub type HashSet_Entry = u8;
        pub type HashSet_Ptr = u8;
        pub type HashSet_AddPtr = u8;
        pub type HashSet_Iterator = u8;
        pub type HashSet_ModIterator = u8;
        pub type HashSet_Range = u8;
        pub type HashSet_Enum = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct PointerHasher {
            pub _address: u8,
        }
        pub type PointerHasher_Lookup<Key> = Key;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct DefaultHasher {
            pub _address: u8,
        }
        pub type DefaultHasher_Lookup<Key> = Key;
        #[test]
        fn __bindgen_test_layout_DefaultHasher_open0_double_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::DefaultHasher>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::DefaultHasher)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::DefaultHasher>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::DefaultHasher)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_DefaultHasher_open0_float_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::DefaultHasher>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::DefaultHasher)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::DefaultHasher>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::DefaultHasher)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct CStringHasher {
            pub _address: u8,
        }
        pub type CStringHasher_Key = *const ::std::os::raw::c_char;
        pub type CStringHasher_Lookup = *const ::std::os::raw::c_char;
        #[test]
        fn bindgen_test_layout_CStringHasher() {
            assert_eq!(
                ::std::mem::size_of::<CStringHasher>(),
                1usize,
                concat!("Size of: ", stringify!(CStringHasher))
            );
            assert_eq!(
                ::std::mem::align_of::<CStringHasher>(),
                1usize,
                concat!("Alignment of ", stringify!(CStringHasher))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct FallibleHashMethods {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashMapEntry {
            pub _address: u8,
        }
        pub type HashMapEntry_KeyType = u8;
        pub type HashMapEntry_ValueType = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct LittleEndian {
            pub _base: u8,
        }
        #[test]
        fn bindgen_test_layout_LittleEndian() {
            assert_eq!(
                ::std::mem::size_of::<LittleEndian>(),
                1usize,
                concat!("Size of: ", stringify!(LittleEndian))
            );
            assert_eq!(
                ::std::mem::align_of::<LittleEndian>(),
                1usize,
                concat!("Alignment of ", stringify!(LittleEndian))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BigEndian {
            pub _base: u8,
        }
        #[test]
        fn bindgen_test_layout_BigEndian() {
            assert_eq!(
                ::std::mem::size_of::<BigEndian>(),
                1usize,
                concat!("Size of: ", stringify!(BigEndian))
            );
            assert_eq!(
                ::std::mem::align_of::<BigEndian>(),
                1usize,
                concat!("Alignment of ", stringify!(BigEndian))
            );
        }
        pub type NetworkEndian = root::mozilla::BigEndian;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct NativeEndian {
            pub _base: u8,
        }
        pub type NativeEndian_super = u8;
        #[test]
        fn bindgen_test_layout_NativeEndian() {
            assert_eq!(
                ::std::mem::size_of::<NativeEndian>(),
                1usize,
                concat!("Size of: ", stringify!(NativeEndian))
            );
            assert_eq!(
                ::std::mem::align_of::<NativeEndian>(),
                1usize,
                concat!("Alignment of ", stringify!(NativeEndian))
            );
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct TimeStamp63Bit {
            pub _bitfield_1: root::__BindgenBitfieldUnit<[u8; 8usize], u64>,
        }
        #[test]
        fn bindgen_test_layout_TimeStamp63Bit() {
            assert_eq!(
                ::std::mem::size_of::<TimeStamp63Bit>(),
                8usize,
                concat!("Size of: ", stringify!(TimeStamp63Bit))
            );
            assert_eq!(
                ::std::mem::align_of::<TimeStamp63Bit>(),
                8usize,
                concat!("Alignment of ", stringify!(TimeStamp63Bit))
            );
        }
        impl TimeStamp63Bit {
            #[inline]
            pub fn mUsedCanonicalNow(&self) -> u64 {
                unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u64) }
            }
            #[inline]
            pub fn set_mUsedCanonicalNow(&mut self, val: u64) {
                unsafe {
                    let val: u64 = ::std::mem::transmute(val);
                    self._bitfield_1.set(0usize, 1u8, val as u64)
                }
            }
            #[inline]
            pub fn mTimeStamp(&self) -> u64 {
                unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 63u8) as u64) }
            }
            #[inline]
            pub fn set_mTimeStamp(&mut self, val: u64) {
                unsafe {
                    let val: u64 = ::std::mem::transmute(val);
                    self._bitfield_1.set(1usize, 63u8, val as u64)
                }
            }
            #[inline]
            pub fn new_bitfield_1(
                mUsedCanonicalNow: u64,
                mTimeStamp: u64,
            ) -> root::__BindgenBitfieldUnit<[u8; 8usize], u64> {
                let mut __bindgen_bitfield_unit: root::__BindgenBitfieldUnit<[u8; 8usize], u64> =
                    Default::default();
                __bindgen_bitfield_unit.set(0usize, 1u8, {
                    let mUsedCanonicalNow: u64 =
                        unsafe { ::std::mem::transmute(mUsedCanonicalNow) };
                    mUsedCanonicalNow as u64
                });
                __bindgen_bitfield_unit.set(1usize, 63u8, {
                    let mTimeStamp: u64 = unsafe { ::std::mem::transmute(mTimeStamp) };
                    mTimeStamp as u64
                });
                __bindgen_bitfield_unit
            }
        }
        pub type TimeStampValue = root::mozilla::TimeStamp63Bit;
        #[doc = " Platform-specific implementation details of BaseTimeDuration."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseTimeDurationPlatformUtils {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_BaseTimeDurationPlatformUtils() {
            assert_eq!(
                ::std::mem::size_of::<BaseTimeDurationPlatformUtils>(),
                1usize,
                concat!("Size of: ", stringify!(BaseTimeDurationPlatformUtils))
            );
            assert_eq!(
                ::std::mem::align_of::<BaseTimeDurationPlatformUtils>(),
                1usize,
                concat!("Alignment of ", stringify!(BaseTimeDurationPlatformUtils))
            );
        }
        #[doc = " Instances of this class represent the length of an interval of time."]
        #[doc = " Negative durations are allowed, meaning the end is before the start."]
        #[doc = ""]
        #[doc = " Internally the duration is stored as a int64_t in units of"]
        #[doc = " PR_TicksPerSecond() when building with NSPR interval timers, or a"]
        #[doc = " system-dependent unit when building with system clocks.  The"]
        #[doc = " system-dependent unit must be constant, otherwise the semantics of"]
        #[doc = " this class would be broken."]
        #[doc = ""]
        #[doc = " The ValueCalculator template parameter determines how arithmetic"]
        #[doc = " operations are performed on the integer count of ticks (mValue)."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseTimeDuration {
            pub mValue: i64,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseTimeDuration__SomethingVeryRandomHere {
            _unused: [u8; 0],
        }
        #[doc = " Perform arithmetic operations on the value of a BaseTimeDuration without"]
        #[doc = " doing strict checks on the range of values."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TimeDurationValueCalculator {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_TimeDurationValueCalculator() {
            assert_eq!(
                ::std::mem::size_of::<TimeDurationValueCalculator>(),
                1usize,
                concat!("Size of: ", stringify!(TimeDurationValueCalculator))
            );
            assert_eq!(
                ::std::mem::align_of::<TimeDurationValueCalculator>(),
                1usize,
                concat!("Alignment of ", stringify!(TimeDurationValueCalculator))
            );
        }
        #[doc = " Specialization of BaseTimeDuration that uses TimeDurationValueCalculator for"]
        #[doc = " arithmetic on the mValue member."]
        #[doc = ""]
        #[doc = " Use this class for time durations that are *not* expected to hold values of"]
        #[doc = " Forever (or the negative equivalent) or when such time duration are *not*"]
        #[doc = " expected to be used in arithmetic operations."]
        pub type TimeDuration = root::mozilla::BaseTimeDuration;
        #[doc = " Instances of this class represent moments in time, or a special"]
        #[doc = " \"null\" moment. We do not use the non-monotonic system clock or"]
        #[doc = " local time, since they can be reset, causing apparent backward"]
        #[doc = " travel in time, which can confuse algorithms. Instead we measure"]
        #[doc = " elapsed time according to the system.  This time can never go"]
        #[doc = " backwards (i.e. it never wraps around, at least not in less than"]
        #[doc = " five million years of system elapsed time). It might not advance"]
        #[doc = " while the system is sleeping. If TimeStamp::SetNow() is not called"]
        #[doc = " at all for hours or days, we might not notice the passage of some"]
        #[doc = " of that time."]
        #[doc = ""]
        #[doc = " We deliberately do not expose a way to convert TimeStamps to some"]
        #[doc = " particular unit. All you can do is compute a difference between two"]
        #[doc = " TimeStamps to get a TimeDuration. You can also add a TimeDuration"]
        #[doc = " to a TimeStamp to get a new TimeStamp. You can't do something"]
        #[doc = " meaningless like add two TimeStamps."]
        #[doc = ""]
        #[doc = " Internally this is implemented as either a wrapper around"]
        #[doc = "   - high-resolution, monotonic, system clocks if they exist on this"]
        #[doc = "     platform"]
        #[doc = "   - PRIntervalTime otherwise.  We detect wraparounds of"]
        #[doc = "     PRIntervalTime and work around them."]
        #[doc = ""]
        #[doc = " This class is similar to C++11's time_point, however it is"]
        #[doc = " explicitly nullable and provides an IsNull() method. time_point"]
        #[doc = " is initialized to the clock's epoch and provides a"]
        #[doc = " time_since_epoch() method that functions similiarly. i.e."]
        #[doc = " t.IsNull() is equivalent to t.time_since_epoch() =="]
        #[doc = " decltype(t)::duration::zero();"]
        #[doc = ""]
        #[doc = " Note that, since TimeStamp objects are small, prefer to pass them by value"]
        #[doc = " unless there is a specific reason not to do so."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TimeStamp {
            #[doc = " When built with PRIntervalTime, a value of 0 means this instance"]
            #[doc = " is \"null\". Otherwise, the low 32 bits represent a PRIntervalTime,"]
            #[doc = " and the high 32 bits represent a counter of the number of"]
            #[doc = " rollovers of PRIntervalTime that we've seen. This counter starts"]
            #[doc = " at 1 to avoid a real time colliding with the \"null\" value."]
            #[doc = ""]
            #[doc = " PR_INTERVAL_MAX is set at 100,000 ticks per second. So the minimum"]
            #[doc = " time to wrap around is about 2^64/100000 seconds, i.e. about"]
            #[doc = " 5,849,424 years."]
            #[doc = ""]
            #[doc = " When using a system clock, a value is system dependent."]
            pub mValue: root::mozilla::TimeStampValue,
        }
        #[test]
        fn bindgen_test_layout_TimeStamp() {
            assert_eq!(
                ::std::mem::size_of::<TimeStamp>(),
                8usize,
                concat!("Size of: ", stringify!(TimeStamp))
            );
            assert_eq!(
                ::std::mem::align_of::<TimeStamp>(),
                8usize,
                concat!("Alignment of ", stringify!(TimeStamp))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<TimeStamp>())).mValue as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(TimeStamp),
                    "::",
                    stringify!(mValue)
                )
            );
        }
        pub type Vector_Impl = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Vector_CapacityAndReserved {
            pub mCapacity: usize,
        }
        pub type Vector_ElementType<T> = T;
        pub const Vector_InlineLength: root::mozilla::Vector__bindgen_ty_1 =
            Vector__bindgen_ty_1::InlineLength;
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum Vector__bindgen_ty_1 {
            InlineLength = 0,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Vector_Range<T> {
            pub mCur: *mut T,
            pub mEnd: *mut T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Vector_ConstRange<T> {
            pub mCur: *const T,
            pub mEnd: *const T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct ScopeExit<ExitFunction> {
            pub mExitFunction: ExitFunction,
            pub mExecuteOnDestruction: bool,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<ExitFunction>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BufferList {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BufferList_Segment {
            pub mData: *mut ::std::os::raw::c_char,
            pub mSize: usize,
            pub mCapacity: usize,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BufferList_IterImpl {
            pub mSegment: usize,
            pub mData: *mut ::std::os::raw::c_char,
            pub mDataEnd: *mut ::std::os::raw::c_char,
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct nsISupports {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct RefPtr<T> {
        pub mRawPtr: *mut T,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
    }
    pub type RefPtr_element_type<T> = T;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct RefPtr_Proxy {
        pub _address: u8,
    }
    pub type RefPtr_Proxy_member_function = u8;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct RefPtr_ConstRemovingRefPtrTraits {
        pub _address: u8,
    }
    pub mod js {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseShape {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct LazyScript {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ObjectGroup {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RegExpShared {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Shape {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Scope {
            _unused: [u8; 0],
        }
        pub mod jit {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct JitCode {
                _unused: [u8; 0],
            }
            #[repr(u16)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum InlinableNative {
                __bindgen_cannot_repr_c_on_empty_enum = 0,
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js29CurrentThreadCanAccessRuntimeEPK9JSRuntime"]
            pub fn CurrentThreadCanAccessRuntime(rt: *const root::JSRuntime) -> bool;
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum ThreadType {
            THREAD_TYPE_NONE = 0,
            THREAD_TYPE_MAIN = 1,
            THREAD_TYPE_WASM = 2,
            THREAD_TYPE_ION = 3,
            THREAD_TYPE_PARSE = 4,
            THREAD_TYPE_COMPRESS = 5,
            THREAD_TYPE_GCPARALLEL = 6,
            THREAD_TYPE_PROMISE_TASK = 7,
            THREAD_TYPE_ION_FREE = 8,
            THREAD_TYPE_WASM_TIER2 = 9,
            THREAD_TYPE_WORKER = 10,
            THREAD_TYPE_MAX = 11,
        }
        #[repr(C)]
        pub struct RunnableTask__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RunnableTask {
            pub vtable_: *const RunnableTask__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_RunnableTask() {
            assert_eq!(
                ::std::mem::size_of::<RunnableTask>(),
                8usize,
                concat!("Size of: ", stringify!(RunnableTask))
            );
            assert_eq!(
                ::std::mem::align_of::<RunnableTask>(),
                8usize,
                concat!("Alignment of ", stringify!(RunnableTask))
            );
        }
        pub mod oom {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AutoEnterOOMUnsafeRegion {
            pub _address: u8,
        }
        pub type AutoEnterOOMUnsafeRegion_AnnotateOOMAllocationSizeCallback =
            ::std::option::Option<unsafe extern "C" fn(arg1: usize)>;
        extern "C" {
            #[link_name = "\u{1}_ZN2js24AutoEnterOOMUnsafeRegion23annotateOOMSizeCallbackE"]
            pub static mut AutoEnterOOMUnsafeRegion_annotateOOMSizeCallback:
                root::js::AutoEnterOOMUnsafeRegion_AnnotateOOMAllocationSizeCallback;
        }
        #[test]
        fn bindgen_test_layout_AutoEnterOOMUnsafeRegion() {
            assert_eq!(
                ::std::mem::size_of::<AutoEnterOOMUnsafeRegion>(),
                1usize,
                concat!("Size of: ", stringify!(AutoEnterOOMUnsafeRegion))
            );
            assert_eq!(
                ::std::mem::align_of::<AutoEnterOOMUnsafeRegion>(),
                1usize,
                concat!("Alignment of ", stringify!(AutoEnterOOMUnsafeRegion))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19InitMallocAllocatorEv"]
            pub fn InitMallocAllocator();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23ShutDownMallocAllocatorEv"]
            pub fn ShutDownMallocAllocator();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js34AssertJSStringBufferInCorrectArenaEPKv"]
            pub fn AssertJSStringBufferInCorrectArena(ptr: *const ::std::os::raw::c_void);
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum AllocFunction {
            Malloc = 0,
            Calloc = 1,
            Realloc = 2,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AllocPolicyBase {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_AllocPolicyBase() {
            assert_eq!(
                ::std::mem::size_of::<AllocPolicyBase>(),
                1usize,
                concat!("Size of: ", stringify!(AllocPolicyBase))
            );
            assert_eq!(
                ::std::mem::align_of::<AllocPolicyBase>(),
                1usize,
                concat!("Alignment of ", stringify!(AllocPolicyBase))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct SystemAllocPolicy {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_SystemAllocPolicy() {
            assert_eq!(
                ::std::mem::size_of::<SystemAllocPolicy>(),
                1usize,
                concat!("Size of: ", stringify!(SystemAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<SystemAllocPolicy>(),
                1usize,
                concat!("Alignment of ", stringify!(SystemAllocPolicy))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17ReportOutOfMemoryEP9JSContext"]
            pub fn ReportOutOfMemory(cx: *mut root::JSContext);
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TempAllocPolicy {
            pub cx_: *mut root::JSContext,
        }
        #[test]
        fn bindgen_test_layout_TempAllocPolicy() {
            assert_eq!(
                ::std::mem::size_of::<TempAllocPolicy>(),
                8usize,
                concat!("Size of: ", stringify!(TempAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<TempAllocPolicy>(),
                8usize,
                concat!("Alignment of ", stringify!(TempAllocPolicy))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<TempAllocPolicy>())).cx_ as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(TempAllocPolicy),
                    "::",
                    stringify!(cx_)
                )
            );
        }
        pub type HashNumber = root::mozilla::HashNumber;
        pub type DefaultHasher = root::mozilla::DefaultHasher;
        pub type PointerHasher = root::mozilla::PointerHasher;
        pub type HashSet = u8;
        pub type HashMap = u8;
        extern "C" {
            #[link_name = "\u{1}_ZN2js26CurrentThreadCanAccessZoneEPN2JS4ZoneE"]
            pub fn CurrentThreadCanAccessZone(zone: *mut root::JS::Zone) -> bool;
        }
        pub mod gc {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Cell {
                _unused: [u8; 0],
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum ColorBit {
                BlackBit = 0,
                GrayOrBlackBit = 1,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum ChunkLocation {
                Invalid = 0,
                Nursery = 1,
                TenuredHeap = 2,
            }
            pub mod detail {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                extern "C" {
                    #[link_name = "\u{1}_ZN2js2gc6detail23CellIsMarkedGrayIfKnownEPKNS0_4CellE"]
                    pub fn CellIsMarkedGrayIfKnown(cell: *const root::js::gc::Cell) -> bool;
                }
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc29PerformIncrementalReadBarrierEN2JS9GCCellPtrE"]
                pub fn PerformIncrementalReadBarrier(thing: root::JS::GCCellPtr);
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc10TraceRealmEP8JSTracerPN2JS5RealmEPKc"]
                pub fn TraceRealm(
                    trc: *mut root::JSTracer,
                    realm: *mut root::JS::Realm,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc15RealmNeedsSweepEPN2JS5RealmE"]
                pub fn RealmNeedsSweep(realm: *mut root::JS::Realm) -> bool;
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct PersistentRootedMarker {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct GCRuntime {
                _unused: [u8; 0],
            }
            extern "C" {
                #[doc = " Create an object providing access to the garbage collector's internal notion"]
                #[doc = " of the current state of memory (both GC heap memory and GCthing-controlled"]
                #[doc = " malloc memory."]
                #[link_name = "\u{1}_ZN2js2gc19NewMemoryInfoObjectEP9JSContext"]
                pub fn NewMemoryInfoObject(cx: *mut root::JSContext) -> *mut root::JSObject;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc25FinalizeDeadNurseryObjectEP9JSContextP8JSObject"]
                pub fn FinalizeDeadNurseryObject(
                    cx: *mut root::JSContext,
                    obj: *mut root::JSObject,
                );
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BarrieredBase {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ProfilingStackFrame {
            pub label_: u64,
            pub dynamicString_: u64,
            pub spOrScript: u64,
            pub pcOffsetIfJS_: u32,
            pub realmID_: u64,
            pub flagsAndCategoryPair_: u32,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum ProfilingStackFrame_Flags {
            IS_LABEL_FRAME = 1,
            IS_SP_MARKER_FRAME = 2,
            IS_JS_FRAME = 4,
            JS_OSR = 8,
            STRING_TEMPLATE_METHOD = 16,
            STRING_TEMPLATE_GETTER = 32,
            STRING_TEMPLATE_SETTER = 64,
            RELEVANT_FOR_JS = 128,
            LABEL_DETERMINED_BY_CATEGORY_PAIR = 256,
            NONSENSITIVE = 512,
            FLAGS_BITCOUNT = 10,
            FLAGS_MASK = 1023,
        }
        pub const ProfilingStackFrame_NullPCOffset: i32 = -1;
        #[test]
        fn bindgen_test_layout_ProfilingStackFrame() {
            assert_eq!(
                ::std::mem::size_of::<ProfilingStackFrame>(),
                48usize,
                concat!("Size of: ", stringify!(ProfilingStackFrame))
            );
            assert_eq!(
                ::std::mem::align_of::<ProfilingStackFrame>(),
                8usize,
                concat!("Alignment of ", stringify!(ProfilingStackFrame))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ProfilingStackFrame>())).label_ as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(label_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ProfilingStackFrame>())).dynamicString_ as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(dynamicString_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ProfilingStackFrame>())).spOrScript as *const _ as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(spOrScript)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ProfilingStackFrame>())).pcOffsetIfJS_ as *const _
                        as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(pcOffsetIfJS_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ProfilingStackFrame>())).realmID_ as *const _ as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(realmID_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ProfilingStackFrame>())).flagsAndCategoryPair_
                        as *const _ as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(flagsAndCategoryPair_)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js24SetContextProfilingStackEP9JSContextP14ProfilingStack"]
            pub fn SetContextProfilingStack(
                cx: *mut root::JSContext,
                profilingStack: *mut root::ProfilingStack,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27EnableContextProfilingStackEP9JSContextb"]
            pub fn EnableContextProfilingStack(cx: *mut root::JSContext, enabled: bool);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js35RegisterContextProfilingEventMarkerEP9JSContextPFvPKcE"]
            pub fn RegisterContextProfilingEventMarker(
                cx: *mut root::JSContext,
                fn_: ::std::option::Option<
                    unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char),
                >,
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AutoGeckoProfilerEntry {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GeckoProfilerEntryMarker {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GeckoProfilerBaselineOSRMarker {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GeckoProfilerThread {
            pub profilingStack_: *mut root::ProfilingStack,
            pub profilingStackIfEnabled_: *mut root::ProfilingStack,
        }
        #[test]
        fn bindgen_test_layout_GeckoProfilerThread() {
            assert_eq!(
                ::std::mem::size_of::<GeckoProfilerThread>(),
                16usize,
                concat!("Size of: ", stringify!(GeckoProfilerThread))
            );
            assert_eq!(
                ::std::mem::align_of::<GeckoProfilerThread>(),
                8usize,
                concat!("Alignment of ", stringify!(GeckoProfilerThread))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<GeckoProfilerThread>())).profilingStack_ as *const _
                        as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(GeckoProfilerThread),
                    "::",
                    stringify!(profilingStack_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<GeckoProfilerThread>())).profilingStackIfEnabled_
                        as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(GeckoProfilerThread),
                    "::",
                    stringify!(profilingStackIfEnabled_)
                )
            );
        }
        pub type UniquePtr = u8;
        pub mod detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct UniqueSelector {
                pub _address: u8,
            }
            pub type UniqueSelector_SingleObject = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct PtrBarrierMethodsBase {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct DefineComparisonOps {
                pub _base: root::mozilla::FalseType,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct TypeIsGCThing {
                pub _base: root::mozilla::FalseType,
            }
            #[test]
            fn __bindgen_test_layout_TypeIsGCThing_open0_Value_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::js::detail::TypeIsGCThing>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::js::detail::TypeIsGCThing)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::js::detail::TypeIsGCThing>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::js::detail::TypeIsGCThing)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail13IdMatchesAtomEN2JS11PropertyKeyEP6JSAtom"]
                pub fn IdMatchesAtom(id: root::jsid, atom: *mut root::JSAtom) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail13IdMatchesAtomEN2JS11PropertyKeyEP8JSString"]
                pub fn IdMatchesAtom1(id: root::jsid, atom: *mut root::JSString) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail12IsWindowSlowEP8JSObject"]
                pub fn IsWindowSlow(obj: *mut root::JSObject) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail25ToWindowProxyIfWindowSlowEP8JSObject"]
                pub fn ToWindowProxyIfWindowSlow(obj: *mut root::JSObject) -> *mut root::JSObject;
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BarrierMethods {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct WrappedPtrOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MutableWrappedPtrOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RootedBase {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HandleBase {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MutableHandleBase {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HeapBase {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsHeapConstructibleType {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_Symbol_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_BigInt_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSAtom_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSFunction_close0_instantiation()
        {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSObject_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSScript_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSString_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_Value_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_PropertyKey_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct PersistentRootedBase {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct FakeRooted {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct FakeMutableHandle {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_ptr_JSObject_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_ptr_JSFunction_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_ptr_JSString_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MovableCellHasher {
            pub _address: u8,
        }
        pub type MovableCellHasher_Key<T> = T;
        pub type MovableCellHasher_Lookup<T> = T;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct DispatchWrapper<T> {
            pub tracer: root::js::DispatchWrapper_TraceFn<T>,
            pub storage: T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        pub type DispatchWrapper_TraceFn<T> = ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut root::JSTracer,
                arg2: *mut T,
                arg3: *const ::std::os::raw::c_char,
            ),
        >;
        #[repr(u32)]
        #[doc = " Types for a variable that either should or shouldn't be rooted, depending on"]
        #[doc = " the template parameter allowGC. Used for implementing functions that can"]
        #[doc = " operate on either rooted or unrooted data."]
        #[doc = ""]
        #[doc = " The toHandle() and toMutableHandle() functions are for calling functions"]
        #[doc = " which require handle types and are only called in the CanGC case. These"]
        #[doc = " allow the calling code to type check."]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum AllowGC {
            NoGC = 0,
            CanGC = 1,
        }
        pub mod gcstats {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Statistics {
                _unused: [u8; 0],
            }
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_Value_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MutableValueOperations {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_PropertyKey_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        pub type LookupPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                objp: root::JS::MutableHandleObject,
                propp: root::JS::MutableHandle<root::JS::PropertyResult>,
            ) -> bool,
        >;
        pub type DefinePropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                desc: root::JS::Handle<root::JS::PropertyDescriptor>,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >;
        pub type HasPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                foundp: *mut bool,
            ) -> bool,
        >;
        pub type GetPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                receiver: root::JS::HandleValue,
                id: root::JS::HandleId,
                vp: root::JS::MutableHandleValue,
            ) -> bool,
        >;
        pub type SetPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                v: root::JS::HandleValue,
                receiver: root::JS::HandleValue,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >;
        pub type GetOwnPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                desc: root::JS::MutableHandle<root::JS::PropertyDescriptor>,
            ) -> bool,
        >;
        pub type DeletePropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >;
        #[repr(C)]
        pub struct ElementAdder {
            pub resObj_: root::JS::RootedObject,
            pub vp_: *mut root::JS::Value,
            pub index_: u32,
            pub getBehavior_: root::js::ElementAdder_GetBehavior,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum ElementAdder_GetBehavior {
            CheckHasElemPreserveHoles = 0,
            GetElement = 1,
        }
        #[test]
        fn bindgen_test_layout_ElementAdder() {
            assert_eq!(
                ::std::mem::size_of::<ElementAdder>(),
                40usize,
                concat!("Size of: ", stringify!(ElementAdder))
            );
            assert_eq!(
                ::std::mem::align_of::<ElementAdder>(),
                8usize,
                concat!("Alignment of ", stringify!(ElementAdder))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ElementAdder>())).resObj_ as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ElementAdder),
                    "::",
                    stringify!(resObj_)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ElementAdder>())).vp_ as *const _ as usize },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ElementAdder),
                    "::",
                    stringify!(vp_)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ElementAdder>())).index_ as *const _ as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ElementAdder),
                    "::",
                    stringify!(index_)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ElementAdder>())).getBehavior_ as *const _ as usize
                },
                36usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ElementAdder),
                    "::",
                    stringify!(getBehavior_)
                )
            );
        }
        pub type GetElementsOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                begin: u32,
                end: u32,
                adder: *mut root::js::ElementAdder,
            ) -> bool,
        >;
        #[doc = " Callback for the creation of constructor and prototype objects."]
        pub type ClassObjectCreationOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                key: root::JSProtoKey,
            ) -> *mut root::JSObject,
        >;
        #[doc = " Callback for custom post-processing after class initialization via"]
        #[doc = " ClassSpec."]
        pub type FinishClassInitOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                ctor: root::JS::HandleObject,
                proto: root::JS::HandleObject,
            ) -> bool,
        >;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ClassSpec {
            pub createConstructor: root::js::ClassObjectCreationOp,
            pub createPrototype: root::js::ClassObjectCreationOp,
            pub constructorFunctions: *const root::JSFunctionSpec,
            pub constructorProperties: *const root::JSPropertySpec,
            pub prototypeFunctions: *const root::JSFunctionSpec,
            pub prototypeProperties: *const root::JSPropertySpec,
            pub finishInit: root::js::FinishClassInitOp,
            pub flags: usize,
        }
        pub const ClassSpec_ProtoKeyWidth: usize = 7;
        pub const ClassSpec_ProtoKeyMask: usize = 127;
        pub const ClassSpec_DontDefineConstructor: usize = 128;
        #[test]
        fn bindgen_test_layout_ClassSpec() {
            assert_eq!(
                ::std::mem::size_of::<ClassSpec>(),
                64usize,
                concat!("Size of: ", stringify!(ClassSpec))
            );
            assert_eq!(
                ::std::mem::align_of::<ClassSpec>(),
                8usize,
                concat!("Alignment of ", stringify!(ClassSpec))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ClassSpec>())).createConstructor as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(createConstructor)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ClassSpec>())).createPrototype as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(createPrototype)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ClassSpec>())).constructorFunctions as *const _ as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(constructorFunctions)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ClassSpec>())).constructorProperties as *const _ as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(constructorProperties)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ClassSpec>())).prototypeFunctions as *const _ as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(prototypeFunctions)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ClassSpec>())).prototypeProperties as *const _ as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(prototypeProperties)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ClassSpec>())).finishInit as *const _ as usize },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(finishInit)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ClassSpec>())).flags as *const _ as usize },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(flags)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ClassExtension {
            #[doc = " Optional hook called when an object is moved by generational or"]
            #[doc = " compacting GC."]
            #[doc = ""]
            #[doc = " There may exist weak pointers to an object that are not traced through"]
            #[doc = " when the normal trace APIs are used, for example objects in the wrapper"]
            #[doc = " cache. This hook allows these pointers to be updated."]
            #[doc = ""]
            #[doc = " Note that this hook can be called before JS_NewObject() returns if a GC"]
            #[doc = " is triggered during construction of the object. This can happen for"]
            #[doc = " global objects for example."]
            #[doc = ""]
            #[doc = " The function should return the difference between nursery bytes used and"]
            #[doc = " tenured bytes used, which may be nonzero e.g. if some nursery-allocated"]
            #[doc = " data beyond the actual GC thing is moved into malloced memory."]
            #[doc = ""]
            #[doc = " This is used to compute the nursery promotion rate."]
            pub objectMovedOp: root::JSObjectMovedOp,
        }
        #[test]
        fn bindgen_test_layout_ClassExtension() {
            assert_eq!(
                ::std::mem::size_of::<ClassExtension>(),
                8usize,
                concat!("Size of: ", stringify!(ClassExtension))
            );
            assert_eq!(
                ::std::mem::align_of::<ClassExtension>(),
                8usize,
                concat!("Alignment of ", stringify!(ClassExtension))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ClassExtension>())).objectMovedOp as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassExtension),
                    "::",
                    stringify!(objectMovedOp)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ObjectOps {
            pub lookupProperty: root::js::LookupPropertyOp,
            pub defineProperty: root::js::DefinePropertyOp,
            pub hasProperty: root::js::HasPropertyOp,
            pub getProperty: root::js::GetPropertyOp,
            pub setProperty: root::js::SetPropertyOp,
            pub getOwnPropertyDescriptor: root::js::GetOwnPropertyOp,
            pub deleteProperty: root::js::DeletePropertyOp,
            pub getElements: root::js::GetElementsOp,
            pub funToString: root::JSFunToStringOp,
        }
        #[test]
        fn bindgen_test_layout_ObjectOps() {
            assert_eq!(
                ::std::mem::size_of::<ObjectOps>(),
                72usize,
                concat!("Size of: ", stringify!(ObjectOps))
            );
            assert_eq!(
                ::std::mem::align_of::<ObjectOps>(),
                8usize,
                concat!("Alignment of ", stringify!(ObjectOps))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ObjectOps>())).lookupProperty as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(lookupProperty)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ObjectOps>())).defineProperty as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(defineProperty)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ObjectOps>())).hasProperty as *const _ as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(hasProperty)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ObjectOps>())).getProperty as *const _ as usize },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(getProperty)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ObjectOps>())).setProperty as *const _ as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(setProperty)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ObjectOps>())).getOwnPropertyDescriptor as *const _
                        as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(getOwnPropertyDescriptor)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ObjectOps>())).deleteProperty as *const _ as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(deleteProperty)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ObjectOps>())).getElements as *const _ as usize },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(getElements)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<ObjectOps>())).funToString as *const _ as usize },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(funToString)
                )
            );
        }
        #[repr(i32)]
        #[doc = " Enumeration describing possible values of the [[Class]] internal property"]
        #[doc = " value of objects."]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum ESClass {
            Object = 0,
            Array = 1,
            Number = 2,
            String = 3,
            Boolean = 4,
            RegExp = 5,
            ArrayBuffer = 6,
            SharedArrayBuffer = 7,
            Date = 8,
            Set = 9,
            Map = 10,
            Promise = 11,
            MapIterator = 12,
            SetIterator = 13,
            Arguments = 14,
            Error = 15,
            BigInt = 16,
            #[doc = " None of the above."]
            Other = 17,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js5UnboxEP9JSContextN2JS6HandleIP8JSObjectEENS2_13MutableHandleINS2_5ValueEEE"]
            pub fn Unbox(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                vp: root::JS::MutableHandleValue,
            ) -> bool;
        }
        pub type Vector = u8;
        #[repr(C)]
        #[derive(Debug)]
        pub struct RefCounted {
            pub mRefCnt: root::MozRefCountType,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct AtomicRefCounted {
            pub mRefCnt: u64,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16AssertHeapIsIdleEv"]
            pub fn AssertHeapIsIdle();
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ScriptSource {
            _unused: [u8; 0],
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum StackFormat {
            SpiderMonkey = 0,
            V8 = 1,
            Default = 2,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14SetStackFormatEP9JSContextNS_11StackFormatE"]
            pub fn SetStackFormat(cx: *mut root::JSContext, format: root::js::StackFormat);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14GetStackFormatEP9JSContext"]
            pub fn GetStackFormat(cx: *mut root::JSContext) -> root::js::StackFormat;
        }
        extern "C" {
            #[doc = " Hint that we expect a crash. Currently, the only thing that cares is the"]
            #[doc = " breakpad injector, which (if loaded) will suppress minidump generation."]
            #[link_name = "\u{1}_ZN2js20NoteIntentionalCrashEv"]
            pub fn NoteIntentionalCrash();
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum CompletionKind {
            Normal = 0,
            Return = 1,
            Throw = 2,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseProxyHandler {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct InterpreterFrame {
            _unused: [u8; 0],
        }
        extern "C" {
            #[doc = " Get the script private value associated with an object, if any."]
            #[doc = ""]
            #[doc = " The private value is set with SetScriptPrivate() or SetModulePrivate() and is"]
            #[doc = " internally stored on the relevant ScriptSourceObject."]
            #[doc = ""]
            #[doc = " This is used by the cycle collector to trace through"]
            #[doc = " ScriptSourceObjects. This allows private values to contain an nsISupports"]
            #[doc = " pointer and hence support references to cycle collected C++ objects."]
            #[link_name = "\u{1}_ZN2js21MaybeGetScriptPrivateEP8JSObject"]
            pub fn MaybeGetScriptPrivate(object: *mut root::JSObject) -> root::JS::Value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js31AssertCompartmentHasSingleRealmEPN2JS11CompartmentE"]
            pub fn AssertCompartmentHasSingleRealm(comp: *mut root::JS::Compartment);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14GetScriptRealmEP8JSScript"]
            pub fn GetScriptRealm(script: *mut root::JSScript) -> *mut root::JS::Realm;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15GetBuiltinClassEP9JSContextN2JS6HandleIP8JSObjectEEPNS_7ESClassE"]
            pub fn GetBuiltinClass(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                cls: *mut root::js::ESClass,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17IsArgumentsObjectEN2JS6HandleIP8JSObjectEE"]
            pub fn IsArgumentsObject(obj: root::JS::HandleObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15ObjectClassNameEP9JSContextN2JS6HandleIP8JSObjectEE"]
            pub fn ObjectClassName(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
            ) -> *const ::std::os::raw::c_char;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18ReportOverRecursedEP9JSContext"]
            pub fn ReportOverRecursed(maybecx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15AddRawValueRootEP9JSContextPN2JS5ValueEPKc"]
            pub fn AddRawValueRoot(
                cx: *mut root::JSContext,
                vp: *mut root::JS::Value,
                name: *const ::std::os::raw::c_char,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18RemoveRawValueRootEP9JSContextPN2JS5ValueE"]
            pub fn RemoveRawValueRoot(cx: *mut root::JSContext, vp: *mut root::JS::Value);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21GetPropertyNameFromPCEP8JSScriptPh"]
            pub fn GetPropertyNameFromPC(
                script: *mut root::JSScript,
                pc: *mut root::jsbytecode,
            ) -> *mut root::JSAtom;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js10DumpStringEP8JSStringP8_IO_FILE"]
            pub fn DumpString(str: *mut root::JSString, fp: *mut root::FILE);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js8DumpAtomEP6JSAtomP8_IO_FILE"]
            pub fn DumpAtom(atom: *mut root::JSAtom, fp: *mut root::FILE);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js10DumpObjectEP8JSObjectP8_IO_FILE"]
            pub fn DumpObject(obj: *mut root::JSObject, fp: *mut root::FILE);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js9DumpCharsEPKDsmP8_IO_FILE"]
            pub fn DumpChars(s: *const u16, n: usize, fp: *mut root::FILE);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js9DumpValueERKN2JS5ValueEP8_IO_FILE"]
            pub fn DumpValue(val: *const root::JS::Value, fp: *mut root::FILE);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js6DumpIdEN2JS11PropertyKeyEP8_IO_FILE"]
            pub fn DumpId(id: root::jsid, fp: *mut root::FILE);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20DumpInterpreterFrameEP9JSContextP8_IO_FILEPNS_16InterpreterFrameE"]
            pub fn DumpInterpreterFrame(
                cx: *mut root::JSContext,
                fp: *mut root::FILE,
                start: *mut root::js::InterpreterFrame,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js6DumpPCEP9JSContextP8_IO_FILE"]
            pub fn DumpPC(cx: *mut root::JSContext, fp: *mut root::FILE) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js10DumpScriptEP9JSContextP8JSScriptP8_IO_FILE"]
            pub fn DumpScript(
                cx: *mut root::JSContext,
                scriptArg: *mut root::JSScript,
                fp: *mut root::FILE,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js10DumpStringEP8JSString"]
            pub fn DumpString1(str: *mut root::JSString);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js8DumpAtomEP6JSAtom"]
            pub fn DumpAtom1(atom: *mut root::JSAtom);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js10DumpObjectEP8JSObject"]
            pub fn DumpObject1(obj: *mut root::JSObject);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js9DumpCharsEPKDsm"]
            pub fn DumpChars1(s: *const u16, n: usize);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js9DumpValueERKN2JS5ValueE"]
            pub fn DumpValue1(val: *const root::JS::Value);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js6DumpIdEN2JS11PropertyKeyE"]
            pub fn DumpId1(id: root::jsid);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20DumpInterpreterFrameEP9JSContextPNS_16InterpreterFrameE"]
            pub fn DumpInterpreterFrame1(
                cx: *mut root::JSContext,
                start: *mut root::js::InterpreterFrame,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js6DumpPCEP9JSContext"]
            pub fn DumpPC1(cx: *mut root::JSContext) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js10DumpScriptEP9JSContextP8JSScript"]
            pub fn DumpScript1(cx: *mut root::JSContext, scriptArg: *mut root::JSScript) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js13DumpBacktraceEP9JSContextP8_IO_FILE"]
            pub fn DumpBacktrace(cx: *mut root::JSContext, fp: *mut root::FILE);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js13DumpBacktraceEP9JSContext"]
            pub fn DumpBacktrace1(cx: *mut root::JSContext);
        }
        extern "C" {
            #[doc = " Use the runtime's internal handling of job queues for Promise jobs."]
            #[doc = ""]
            #[doc = " Most embeddings, notably web browsers, will have their own task scheduling"]
            #[doc = " systems and need to integrate handling of Promise jobs into that, so they"]
            #[doc = " will want to manage job queues themselves. For basic embeddings such as the"]
            #[doc = " JS shell that don't have an event loop of their own, it's easier to have"]
            #[doc = " SpiderMonkey handle job queues internally."]
            #[doc = ""]
            #[doc = " Note that the embedding still has to trigger processing of job queues at"]
            #[doc = " right time(s), such as after evaluation of a script has run to completion."]
            #[link_name = "\u{1}_ZN2js20UseInternalJobQueuesEP9JSContext"]
            pub fn UseInternalJobQueues(cx: *mut root::JSContext) -> bool;
        }
        extern "C" {
            #[doc = " Enqueue |job| on the internal job queue."]
            #[doc = ""]
            #[doc = " This is useful in tests for creating situations where a call occurs with no"]
            #[doc = " other JavaScript on the stack."]
            #[link_name = "\u{1}_ZN2js10EnqueueJobEP9JSContextN2JS6HandleIP8JSObjectEE"]
            pub fn EnqueueJob(cx: *mut root::JSContext, job: root::JS::HandleObject) -> bool;
        }
        extern "C" {
            #[doc = " Instruct the runtime to stop draining the internal job queue."]
            #[doc = ""]
            #[doc = " Useful if the embedding is in the process of quitting in reaction to a"]
            #[doc = " builtin being called, or if it wants to resume executing jobs later on."]
            #[link_name = "\u{1}_ZN2js20StopDrainingJobQueueEP9JSContext"]
            pub fn StopDrainingJobQueue(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js7RunJobsEP9JSContext"]
            pub fn RunJobs(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12GetRealmZoneEPN2JS5RealmE"]
            pub fn GetRealmZone(realm: *mut root::JS::Realm) -> *mut root::JS::Zone;
        }
        pub type PreserveWrapperCallback = ::std::option::Option<
            unsafe extern "C" fn(cx: *mut root::JSContext, obj: root::JS::HandleObject) -> bool,
        >;
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum DumpHeapNurseryBehaviour {
            CollectNurseryBeforeDump = 0,
            IgnoreNurseryObjects = 1,
        }
        extern "C" {
            #[doc = " Dump the complete object graph of heap-allocated things."]
            #[doc = " fp is the file for the dump output."]
            #[link_name = "\u{1}_ZN2js8DumpHeapEP9JSContextP8_IO_FILENS_24DumpHeapNurseryBehaviourEPFmPKvE"]
            pub fn DumpHeap(
                cx: *mut root::JSContext,
                fp: *mut root::FILE,
                nurseryBehaviour: root::js::DumpHeapNurseryBehaviour,
                mallocSizeOf: root::mozilla::MallocSizeOf,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js13IsSystemRealmEPN2JS5RealmE"]
            pub fn IsSystemRealm(realm: *mut root::JS::Realm) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19IsSystemCompartmentEPN2JS11CompartmentE"]
            pub fn IsSystemCompartment(comp: *mut root::JS::Compartment) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12IsSystemZoneEPN2JS4ZoneE"]
            pub fn IsSystemZone(zone: *mut root::JS::Zone) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js11IsAtomsZoneEPN2JS4ZoneE"]
            pub fn IsAtomsZone(zone: *mut root::JS::Zone) -> bool;
        }
        #[repr(C)]
        pub struct WeakMapTracer__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct WeakMapTracer {
            pub vtable_: *const WeakMapTracer__bindgen_vtable,
            pub runtime: *mut root::JSRuntime,
        }
        #[test]
        fn bindgen_test_layout_WeakMapTracer() {
            assert_eq!(
                ::std::mem::size_of::<WeakMapTracer>(),
                16usize,
                concat!("Size of: ", stringify!(WeakMapTracer))
            );
            assert_eq!(
                ::std::mem::align_of::<WeakMapTracer>(),
                8usize,
                concat!("Alignment of ", stringify!(WeakMapTracer))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<WeakMapTracer>())).runtime as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(WeakMapTracer),
                    "::",
                    stringify!(runtime)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js13TraceWeakMapsEPNS_13WeakMapTracerE"]
            pub fn TraceWeakMaps(trc: *mut root::js::WeakMapTracer);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18AreGCGrayBitsValidEP9JSRuntime"]
            pub fn AreGCGrayBitsValid(rt: *mut root::JSRuntime) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21ZoneGlobalsAreAllGrayEPN2JS4ZoneE"]
            pub fn ZoneGlobalsAreAllGray(zone: *mut root::JS::Zone) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js37IsCompartmentZoneSweepingOrCompactingEPN2JS11CompartmentE"]
            pub fn IsCompartmentZoneSweepingOrCompacting(comp: *mut root::JS::Compartment) -> bool;
        }
        pub type GCThingCallback = ::std::option::Option<
            unsafe extern "C" fn(closure: *mut ::std::os::raw::c_void, thing: root::JS::GCCellPtr),
        >;
        extern "C" {
            #[link_name = "\u{1}_ZN2js23VisitGrayWrapperTargetsEPN2JS4ZoneEPFvPvNS0_9GCCellPtrEES3_"]
            pub fn VisitGrayWrapperTargets(
                zone: *mut root::JS::Zone,
                callback: root::js::GCThingCallback,
                closure: *mut ::std::os::raw::c_void,
            );
        }
        extern "C" {
            #[doc = " Invoke cellCallback on every gray JSObject in the given zone."]
            #[link_name = "\u{1}_ZN2js18IterateGrayObjectsEPN2JS4ZoneEPFvPvNS0_9GCCellPtrEES3_"]
            pub fn IterateGrayObjects(
                zone: *mut root::JS::Zone,
                cellCallback: root::js::GCThingCallback,
                data: *mut ::std::os::raw::c_void,
            );
        }
        extern "C" {
            #[doc = " Invoke cellCallback on every gray JSObject in the given zone while cycle"]
            #[doc = " collection is in progress."]
            #[link_name = "\u{1}_ZN2js25IterateGrayObjectsUnderCCEPN2JS4ZoneEPFvPvNS0_9GCCellPtrEES3_"]
            pub fn IterateGrayObjectsUnderCC(
                zone: *mut root::JS::Zone,
                cellCallback: root::js::GCThingCallback,
                data: *mut ::std::os::raw::c_void,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17GetAnyRealmInZoneEPN2JS4ZoneE"]
            pub fn GetAnyRealmInZone(zone: *mut root::JS::Zone) -> *mut root::JS::Realm;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27GetFirstGlobalInCompartmentEPN2JS11CompartmentE"]
            pub fn GetFirstGlobalInCompartment(
                comp: *mut root::JS::Compartment,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js24CompartmentHasLiveGlobalEPN2JS11CompartmentE"]
            pub fn CompartmentHasLiveGlobal(comp: *mut root::JS::Compartment) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21IsSharableCompartmentEPN2JS11CompartmentE"]
            pub fn IsSharableCompartment(comp: *mut root::JS::Compartment) -> bool;
        }
        pub mod shadow {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ObjectGroup {
                pub clasp: *const root::JSClass,
                pub proto: *mut root::JSObject,
                pub realm: *mut root::JS::Realm,
            }
            #[test]
            fn bindgen_test_layout_ObjectGroup() {
                assert_eq!(
                    ::std::mem::size_of::<ObjectGroup>(),
                    24usize,
                    concat!("Size of: ", stringify!(ObjectGroup))
                );
                assert_eq!(
                    ::std::mem::align_of::<ObjectGroup>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ObjectGroup))
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<ObjectGroup>())).clasp as *const _ as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ObjectGroup),
                        "::",
                        stringify!(clasp)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<ObjectGroup>())).proto as *const _ as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ObjectGroup),
                        "::",
                        stringify!(proto)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<ObjectGroup>())).realm as *const _ as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ObjectGroup),
                        "::",
                        stringify!(realm)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct BaseShape {
                pub clasp_: *const root::JSClass,
                pub parent: *mut root::JSObject,
            }
            #[test]
            fn bindgen_test_layout_BaseShape() {
                assert_eq!(
                    ::std::mem::size_of::<BaseShape>(),
                    16usize,
                    concat!("Size of: ", stringify!(BaseShape))
                );
                assert_eq!(
                    ::std::mem::align_of::<BaseShape>(),
                    8usize,
                    concat!("Alignment of ", stringify!(BaseShape))
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<BaseShape>())).clasp_ as *const _ as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BaseShape),
                        "::",
                        stringify!(clasp_)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<BaseShape>())).parent as *const _ as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BaseShape),
                        "::",
                        stringify!(parent)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Shape {
                pub base: *mut root::js::shadow::BaseShape,
                pub _1: root::jsid,
                pub immutableFlags: u32,
            }
            pub const Shape_FIXED_SLOTS_SHIFT: u32 = 24;
            pub const Shape_FIXED_SLOTS_MASK: u32 = 520093696;
            #[test]
            fn bindgen_test_layout_Shape() {
                assert_eq!(
                    ::std::mem::size_of::<Shape>(),
                    24usize,
                    concat!("Size of: ", stringify!(Shape))
                );
                assert_eq!(
                    ::std::mem::align_of::<Shape>(),
                    8usize,
                    concat!("Alignment of ", stringify!(Shape))
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Shape>())).base as *const _ as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Shape),
                        "::",
                        stringify!(base)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Shape>()))._1 as *const _ as usize },
                    8usize,
                    concat!("Offset of field: ", stringify!(Shape), "::", stringify!(_1))
                );
                assert_eq!(
                    unsafe {
                        &(*(::std::ptr::null::<Shape>())).immutableFlags as *const _ as usize
                    },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Shape),
                        "::",
                        stringify!(immutableFlags)
                    )
                );
            }
            #[doc = " This layout is shared by all native objects. For non-native objects, the"]
            #[doc = " group may always be accessed safely, and other members may be as well,"]
            #[doc = " depending on the object's specific layout."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Object {
                pub group: *mut root::js::shadow::ObjectGroup,
                pub shape: *mut root::js::shadow::Shape,
                pub slots: *mut root::JS::Value,
                pub _1: *mut ::std::os::raw::c_void,
            }
            pub const Object_MAX_FIXED_SLOTS: usize = 16;
            #[test]
            fn bindgen_test_layout_Object() {
                assert_eq!(
                    ::std::mem::size_of::<Object>(),
                    32usize,
                    concat!("Size of: ", stringify!(Object))
                );
                assert_eq!(
                    ::std::mem::align_of::<Object>(),
                    8usize,
                    concat!("Alignment of ", stringify!(Object))
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Object>())).group as *const _ as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Object),
                        "::",
                        stringify!(group)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Object>())).shape as *const _ as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Object),
                        "::",
                        stringify!(shape)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Object>())).slots as *const _ as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Object),
                        "::",
                        stringify!(slots)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Object>()))._1 as *const _ as usize },
                    24usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Object),
                        "::",
                        stringify!(_1)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Function {
                pub base: root::js::shadow::Object,
                pub nargs: u16,
                pub flags: u16,
                pub native: root::JSNative,
                pub jitinfo: *const root::JSJitInfo,
                pub _1: *mut ::std::os::raw::c_void,
            }
            #[test]
            fn bindgen_test_layout_Function() {
                assert_eq!(
                    ::std::mem::size_of::<Function>(),
                    64usize,
                    concat!("Size of: ", stringify!(Function))
                );
                assert_eq!(
                    ::std::mem::align_of::<Function>(),
                    8usize,
                    concat!("Alignment of ", stringify!(Function))
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Function>())).base as *const _ as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Function),
                        "::",
                        stringify!(base)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Function>())).nargs as *const _ as usize },
                    32usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Function),
                        "::",
                        stringify!(nargs)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Function>())).flags as *const _ as usize },
                    34usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Function),
                        "::",
                        stringify!(flags)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Function>())).native as *const _ as usize },
                    40usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Function),
                        "::",
                        stringify!(native)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Function>())).jitinfo as *const _ as usize },
                    48usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Function),
                        "::",
                        stringify!(jitinfo)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::std::ptr::null::<Function>()))._1 as *const _ as usize },
                    56usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(Function),
                        "::",
                        stringify!(_1)
                    )
                );
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15ProtoKeyToClassE10JSProtoKey"]
            pub fn ProtoKeyToClass(key: root::JSProtoKey) -> *const root::JSClass;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js30ShouldIgnorePropertyDefinitionEP9JSContext10JSProtoKeyN2JS11PropertyKeyE"]
            pub fn ShouldIgnorePropertyDefinition(
                cx: *mut root::JSContext,
                key: root::JSProtoKey,
                id: root::jsid,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16IsFunctionObjectEP8JSObject"]
            pub fn IsFunctionObject(obj: *mut root::JSObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js34UninlinedIsCrossCompartmentWrapperEPK8JSObject"]
            pub fn UninlinedIsCrossCompartmentWrapper(obj: *const root::JSObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19GetPrototypeNoProxyEP8JSObject"]
            pub fn GetPrototypeNoProxy(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21AssertSameCompartmentEP9JSContextP8JSObject"]
            pub fn AssertSameCompartment(cx: *mut root::JSContext, obj: *mut root::JSObject);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21AssertSameCompartmentEP9JSContextN2JS6HandleINS2_5ValueEEE"]
            pub fn AssertSameCompartment1(cx: *mut root::JSContext, v: root::JS::HandleValue);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23NotifyAnimationActivityEP8JSObject"]
            pub fn NotifyAnimationActivity(obj: *mut root::JSObject);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js26DefineFunctionWithReservedEP9JSContextP8JSObjectPKcPFbS1_jPN2JS5ValueEEjj"]
            pub fn DefineFunctionWithReserved(
                cx: *mut root::JSContext,
                obj: *mut root::JSObject,
                name: *const ::std::os::raw::c_char,
                call: root::JSNative,
                nargs: ::std::os::raw::c_uint,
                attrs: ::std::os::raw::c_uint,
            ) -> *mut root::JSFunction;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23NewFunctionWithReservedEP9JSContextPFbS1_jPN2JS5ValueEEjjPKc"]
            pub fn NewFunctionWithReserved(
                cx: *mut root::JSContext,
                call: root::JSNative,
                nargs: ::std::os::raw::c_uint,
                flags: ::std::os::raw::c_uint,
                name: *const ::std::os::raw::c_char,
            ) -> *mut root::JSFunction;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27NewFunctionByIdWithReservedEP9JSContextPFbS1_jPN2JS5ValueEEjjNS2_11PropertyKeyE"]
            pub fn NewFunctionByIdWithReserved(
                cx: *mut root::JSContext,
                native: root::JSNative,
                nargs: ::std::os::raw::c_uint,
                flags: ::std::os::raw::c_uint,
                id: root::jsid,
            ) -> *mut root::JSFunction;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js25GetFunctionNativeReservedEP8JSObjectm"]
            pub fn GetFunctionNativeReserved(
                fun: *mut root::JSObject,
                which: usize,
            ) -> *const root::JS::Value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js25SetFunctionNativeReservedEP8JSObjectmRKN2JS5ValueE"]
            pub fn SetFunctionNativeReserved(
                fun: *mut root::JSObject,
                which: usize,
                val: *const root::JS::Value,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js25FunctionHasNativeReservedEP8JSObject"]
            pub fn FunctionHasNativeReserved(fun: *mut root::JSObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14GetObjectProtoEP9JSContextN2JS6HandleIP8JSObjectEENS2_13MutableHandleIS5_EE"]
            pub fn GetObjectProto(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                proto: root::JS::MutableHandleObject,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18GetStaticPrototypeEP8JSObject"]
            pub fn GetStaticPrototype(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20GetRealmOriginalEvalEP9JSContextN2JS13MutableHandleIP8JSObjectEE"]
            pub fn GetRealmOriginalEval(
                cx: *mut root::JSContext,
                eval: root::JS::MutableHandleObject,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js26SetReservedSlotWithBarrierEP8JSObjectmRKN2JS5ValueE"]
            pub fn SetReservedSlotWithBarrier(
                obj: *mut root::JSObject,
                slot: usize,
                value: *const root::JS::Value,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17GetObjectSlotSpanEP8JSObject"]
            pub fn GetObjectSlotSpan(obj: *mut root::JSObject) -> u32;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js24StringToLinearStringSlowEP9JSContextP8JSString"]
            pub fn StringToLinearStringSlow(
                cx: *mut root::JSContext,
                str: *mut root::JSString,
            ) -> *mut root::JSLinearString;
        }
        extern "C" {
            #[doc = " Add some or all property keys of obj to the id vector *props."]
            #[doc = ""]
            #[doc = " The flags parameter controls which property keys are added. Pass a"]
            #[doc = " combination of the following bits:"]
            #[doc = ""]
            #[doc = "     JSITER_OWNONLY - Don't also search the prototype chain; only consider"]
            #[doc = "       obj's own properties."]
            #[doc = ""]
            #[doc = "     JSITER_HIDDEN - Include nonenumerable properties."]
            #[doc = ""]
            #[doc = "     JSITER_SYMBOLS - Include property keys that are symbols. The default"]
            #[doc = "       behavior is to filter out symbols."]
            #[doc = ""]
            #[doc = "     JSITER_SYMBOLSONLY - Exclude non-symbol property keys."]
            #[doc = ""]
            #[doc = " This is the closest C++ API we have to `Reflect.ownKeys(obj)`, or"]
            #[doc = " equivalently, the ES6 [[OwnPropertyKeys]] internal method. Pass"]
            #[doc = " `JSITER_OWNONLY | JSITER_HIDDEN | JSITER_SYMBOLS` as flags to get"]
            #[doc = " results that match the output of Reflect.ownKeys."]
            #[link_name = "\u{1}_ZN2js15GetPropertyKeysEP9JSContextN2JS6HandleIP8JSObjectEEjNS2_13MutableHandleINS2_13StackGCVectorINS2_11PropertyKeyENS_15TempAllocPolicyEEEEE"]
            pub fn GetPropertyKeys(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                flags: ::std::os::raw::c_uint,
                props: root::JS::MutableHandleIdVector,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12AppendUniqueEP9JSContextN2JS13MutableHandleINS2_13StackGCVectorINS2_11PropertyKeyENS_15TempAllocPolicyEEEEENS2_6HandleIS7_EE"]
            pub fn AppendUnique(
                cx: *mut root::JSContext,
                base: root::JS::MutableHandleIdVector,
                others: root::JS::HandleIdVector,
            ) -> bool;
        }
        extern "C" {
            #[doc = " Determine whether the given string is an array index in the sense of"]
            #[doc = " <https://tc39.github.io/ecma262/#array-index>."]
            #[doc = ""]
            #[doc = " If it isn't, returns false."]
            #[doc = ""]
            #[doc = " If it is, returns true and outputs the index in *indexp."]
            #[link_name = "\u{1}_ZN2js18StringIsArrayIndexEP14JSLinearStringPj"]
            pub fn StringIsArrayIndex(str: *mut root::JSLinearString, indexp: *mut u32) -> bool;
        }
        extern "C" {
            #[doc = " Overloads of StringIsArrayIndex taking (char*,length) pairs.  These"]
            #[doc = " behave the same as the JSLinearString version."]
            #[link_name = "\u{1}_ZN2js18StringIsArrayIndexEPKcjPj"]
            pub fn StringIsArrayIndex1(
                str: *const ::std::os::raw::c_char,
                length: u32,
                indexp: *mut u32,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18StringIsArrayIndexEPKDsjPj"]
            pub fn StringIsArrayIndex2(str: *const u16, length: u32, indexp: *mut u32) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js26SetPreserveWrapperCallbackEP9JSContextPFbS1_N2JS6HandleIP8JSObjectEEE"]
            pub fn SetPreserveWrapperCallback(
                cx: *mut root::JSContext,
                callback: root::js::PreserveWrapperCallback,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js28IsObjectInContextCompartmentEP8JSObjectPK9JSContext"]
            pub fn IsObjectInContextCompartment(
                obj: *mut root::JSObject,
                cx: *const root::JSContext,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js28RunningWithTrustedPrincipalsEP9JSContext"]
            pub fn RunningWithTrustedPrincipals(cx: *mut root::JSContext) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21StartPCCountProfilingEP9JSContext"]
            pub fn StartPCCountProfiling(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20StopPCCountProfilingEP9JSContext"]
            pub fn StopPCCountProfiling(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js13PurgePCCountsEP9JSContext"]
            pub fn PurgePCCounts(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21GetPCCountScriptCountEP9JSContext"]
            pub fn GetPCCountScriptCount(cx: *mut root::JSContext) -> usize;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23GetPCCountScriptSummaryEP9JSContextm"]
            pub fn GetPCCountScriptSummary(
                cx: *mut root::JSContext,
                script: usize,
            ) -> *mut root::JSString;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js24GetPCCountScriptContentsEP9JSContextm"]
            pub fn GetPCCountScriptContents(
                cx: *mut root::JSContext,
                script: usize,
            ) -> *mut root::JSString;
        }
        extern "C" {
            #[doc = " Generate lcov trace file content for the current realm, and allocate a new"]
            #[doc = " buffer and return the content in it, the size of the newly allocated content"]
            #[doc = " within the buffer would be set to the length out-param. The 'All' variant"]
            #[doc = " will collect data for all realms in the runtime."]
            #[doc = ""]
            #[doc = " In case of out-of-memory, this function returns nullptr. The length"]
            #[doc = " out-param is undefined on failure."]
            #[link_name = "\u{1}_ZN2js22GetCodeCoverageSummaryEP9JSContextPm"]
            pub fn GetCodeCoverageSummary(
                cx: *mut root::JSContext,
                length: *mut usize,
            ) -> root::JS::UniqueChars;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js25GetCodeCoverageSummaryAllEP9JSContextPm"]
            pub fn GetCodeCoverageSummaryAll(
                cx: *mut root::JSContext,
                length: *mut usize,
            ) -> root::JS::UniqueChars;
        }
        pub type DOMInstanceClassHasProtoAtDepth = ::std::option::Option<
            unsafe extern "C" fn(
                instanceClass: *const root::JSClass,
                protoID: u32,
                depth: u32,
            ) -> bool,
        >;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct JSDOMCallbacks {
            pub instanceClassMatchesProto: root::js::DOMInstanceClassHasProtoAtDepth,
        }
        #[test]
        fn bindgen_test_layout_JSDOMCallbacks() {
            assert_eq!(
                ::std::mem::size_of::<JSDOMCallbacks>(),
                8usize,
                concat!("Size of: ", stringify!(JSDOMCallbacks))
            );
            assert_eq!(
                ::std::mem::align_of::<JSDOMCallbacks>(),
                8usize,
                concat!("Alignment of ", stringify!(JSDOMCallbacks))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<JSDOMCallbacks>())).instanceClassMatchesProto as *const _
                        as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(JSDOMCallbacks),
                    "::",
                    stringify!(instanceClassMatchesProto)
                )
            );
        }
        pub type DOMCallbacks = root::js::JSDOMCallbacks;
        extern "C" {
            #[link_name = "\u{1}_ZN2js15SetDOMCallbacksEP9JSContextPKNS_14JSDOMCallbacksE"]
            pub fn SetDOMCallbacks(
                cx: *mut root::JSContext,
                callbacks: *const root::js::DOMCallbacks,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15GetDOMCallbacksEP9JSContext"]
            pub fn GetDOMCallbacks(cx: *mut root::JSContext) -> *const root::js::DOMCallbacks;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19GetTestingFunctionsEP9JSContext"]
            pub fn GetTestingFunctions(cx: *mut root::JSContext) -> *mut root::JSObject;
        }
        extern "C" {
            #[doc = " Get an error type name from a JSExnType constant."]
            #[doc = " Returns nullptr for invalid arguments and JSEXN_INTERNALERR"]
            #[link_name = "\u{1}_ZN2js16GetErrorTypeNameEP9JSContexts"]
            pub fn GetErrorTypeName(
                cx: *mut root::JSContext,
                exnType: i16,
            ) -> *mut root::JSLinearString;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23RegExpToSharedNonInlineEP9JSContextN2JS6HandleIP8JSObjectEE"]
            pub fn RegExpToSharedNonInline(
                cx: *mut root::JSContext,
                regexp: root::JS::HandleObject,
            ) -> *mut root::js::RegExpShared;
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum NukeReferencesToWindow {
            NukeWindowReferences = 0,
            DontNukeWindowReferences = 1,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum NukeReferencesFromTarget {
            NukeAllReferences = 0,
            NukeIncomingReferences = 1,
        }
        #[repr(C)]
        pub struct CompartmentFilter__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct CompartmentFilter {
            pub vtable_: *const CompartmentFilter__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_CompartmentFilter() {
            assert_eq!(
                ::std::mem::size_of::<CompartmentFilter>(),
                8usize,
                concat!("Size of: ", stringify!(CompartmentFilter))
            );
            assert_eq!(
                ::std::mem::align_of::<CompartmentFilter>(),
                8usize,
                concat!("Alignment of ", stringify!(CompartmentFilter))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AllCompartments {
            pub _base: root::js::CompartmentFilter,
        }
        #[test]
        fn bindgen_test_layout_AllCompartments() {
            assert_eq!(
                ::std::mem::size_of::<AllCompartments>(),
                8usize,
                concat!("Size of: ", stringify!(AllCompartments))
            );
            assert_eq!(
                ::std::mem::align_of::<AllCompartments>(),
                8usize,
                concat!("Alignment of ", stringify!(AllCompartments))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ContentCompartmentsOnly {
            pub _base: root::js::CompartmentFilter,
        }
        #[test]
        fn bindgen_test_layout_ContentCompartmentsOnly() {
            assert_eq!(
                ::std::mem::size_of::<ContentCompartmentsOnly>(),
                8usize,
                concat!("Size of: ", stringify!(ContentCompartmentsOnly))
            );
            assert_eq!(
                ::std::mem::align_of::<ContentCompartmentsOnly>(),
                8usize,
                concat!("Alignment of ", stringify!(ContentCompartmentsOnly))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ChromeCompartmentsOnly {
            pub _base: root::js::CompartmentFilter,
        }
        #[test]
        fn bindgen_test_layout_ChromeCompartmentsOnly() {
            assert_eq!(
                ::std::mem::size_of::<ChromeCompartmentsOnly>(),
                8usize,
                concat!("Size of: ", stringify!(ChromeCompartmentsOnly))
            );
            assert_eq!(
                ::std::mem::align_of::<ChromeCompartmentsOnly>(),
                8usize,
                concat!("Alignment of ", stringify!(ChromeCompartmentsOnly))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct SingleCompartment {
            pub _base: root::js::CompartmentFilter,
            pub ours: *mut root::JS::Compartment,
        }
        #[test]
        fn bindgen_test_layout_SingleCompartment() {
            assert_eq!(
                ::std::mem::size_of::<SingleCompartment>(),
                16usize,
                concat!("Size of: ", stringify!(SingleCompartment))
            );
            assert_eq!(
                ::std::mem::align_of::<SingleCompartment>(),
                8usize,
                concat!("Alignment of ", stringify!(SingleCompartment))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<SingleCompartment>())).ours as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SingleCompartment),
                    "::",
                    stringify!(ours)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js28NukeCrossCompartmentWrappersEP9JSContextRKNS_17CompartmentFilterEPN2JS5RealmENS_22NukeReferencesToWindowENS_24NukeReferencesFromTargetE"]
            pub fn NukeCrossCompartmentWrappers(
                cx: *mut root::JSContext,
                sourceFilter: *const root::js::CompartmentFilter,
                target: *mut root::JS::Realm,
                nukeReferencesToWindow: root::js::NukeReferencesToWindow,
                nukeReferencesFromTarget: root::js::NukeReferencesFromTarget,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15AllowNewWrapperEPN2JS11CompartmentEP8JSObject"]
            pub fn AllowNewWrapper(
                target: *mut root::JS::Compartment,
                obj: *mut root::JSObject,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16NukedObjectRealmEP8JSObject"]
            pub fn NukedObjectRealm(obj: *mut root::JSObject) -> bool;
        }
        #[repr(C)]
        pub struct ExpandoAndGeneration {
            pub expando: root::JS::Heap<root::JS::Value>,
            pub generation: u64,
        }
        #[test]
        fn bindgen_test_layout_ExpandoAndGeneration() {
            assert_eq!(
                ::std::mem::size_of::<ExpandoAndGeneration>(),
                16usize,
                concat!("Size of: ", stringify!(ExpandoAndGeneration))
            );
            assert_eq!(
                ::std::mem::align_of::<ExpandoAndGeneration>(),
                8usize,
                concat!("Alignment of ", stringify!(ExpandoAndGeneration))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ExpandoAndGeneration>())).expando as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ExpandoAndGeneration),
                    "::",
                    stringify!(expando)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<ExpandoAndGeneration>())).generation as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ExpandoAndGeneration),
                    "::",
                    stringify!(generation)
                )
            );
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum DOMProxyShadowsResult {
            ShadowCheckFailed = 0,
            Shadows = 1,
            DoesntShadow = 2,
            DoesntShadowUnique = 3,
            ShadowsViaDirectExpando = 4,
            ShadowsViaIndirectExpando = 5,
        }
        pub type DOMProxyShadowsCheck = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                object: root::JS::HandleObject,
                id: root::JS::HandleId,
            ) -> root::js::DOMProxyShadowsResult,
        >;
        extern "C" {
            #[link_name = "\u{1}_ZN2js22SetDOMProxyInformationEPKvPFNS_21DOMProxyShadowsResultEP9JSContextN2JS6HandleIP8JSObjectEENS6_INS5_11PropertyKeyEEEES1_"]
            pub fn SetDOMProxyInformation(
                domProxyHandlerFamily: *const ::std::os::raw::c_void,
                domProxyShadowsCheck: root::js::DOMProxyShadowsCheck,
                domRemoteProxyHandlerFamily: *const ::std::os::raw::c_void,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js24GetDOMProxyHandlerFamilyEv"]
            pub fn GetDOMProxyHandlerFamily() -> *const ::std::os::raw::c_void;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23GetDOMProxyShadowsCheckEv"]
            pub fn GetDOMProxyShadowsCheck() -> root::js::DOMProxyShadowsCheck;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js30GetDOMRemoteProxyHandlerFamilyEv"]
            pub fn GetDOMRemoteProxyHandlerFamily() -> *const ::std::os::raw::c_void;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js22IsDOMRemoteProxyObjectEP8JSObject"]
            pub fn IsDOMRemoteProxyObject(object: *mut root::JSObject) -> bool;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct XrayJitInfo {
            pub isCrossCompartmentXray: ::std::option::Option<
                unsafe extern "C" fn(handler: *const root::js::BaseProxyHandler) -> bool,
            >,
            pub compartmentHasExclusiveExpandos:
                ::std::option::Option<unsafe extern "C" fn(obj: *mut root::JSObject) -> bool>,
            pub xrayHolderSlot: usize,
            pub holderExpandoSlot: usize,
            pub expandoProtoSlot: usize,
        }
        #[test]
        fn bindgen_test_layout_XrayJitInfo() {
            assert_eq!(
                ::std::mem::size_of::<XrayJitInfo>(),
                40usize,
                concat!("Size of: ", stringify!(XrayJitInfo))
            );
            assert_eq!(
                ::std::mem::align_of::<XrayJitInfo>(),
                8usize,
                concat!("Alignment of ", stringify!(XrayJitInfo))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<XrayJitInfo>())).isCrossCompartmentXray as *const _
                        as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(XrayJitInfo),
                    "::",
                    stringify!(isCrossCompartmentXray)
                )
            );
            assert_eq!(
                unsafe {
